MikroElektronika/core_packages/PIC/XC8/def/PIC16F917/mcu.h
// Register: IOCB
#define IOCB IOCB
extern volatile unsigned char           IOCB                __at(0x096);
#ifndef _LIB_BUILD
asm("IOCB equ 096h");
#endif
// aliases
extern volatile unsigned char           IOC                 __at(0x096);
#ifndef _LIB_BUILD
asm("IOC equ 096h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned IOCB                   :4;
    };
    struct {
        unsigned                        :4;
        unsigned IOCB4                  :1;
        unsigned IOCB5                  :1;
        unsigned IOCB6                  :1;
        unsigned IOCB7                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned IOC4                   :1;
        unsigned IOC5                   :1;
        unsigned IOC6                   :1;
        unsigned IOC7                   :1;
    };
} IOCBbits_t;
extern volatile IOCBbits_t IOCBbits __at(0x096);
// bitfield macros
#define _IOCB_IOCB_POSN                                     0x4
#define _IOCB_IOCB_POSITION                                 0x4
#define _IOCB_IOCB_SIZE                                     0x4
#define _IOCB_IOCB_LENGTH                                   0x4
#define _IOCB_IOCB_MASK                                     0xF0
#define _IOCB_IOCB4_POSN                                    0x4
#define _IOCB_IOCB4_POSITION                                0x4
#define _IOCB_IOCB4_SIZE                                    0x1
#define _IOCB_IOCB4_LENGTH                                  0x1
#define _IOCB_IOCB4_MASK                                    0x10
#define _IOCB_IOCB5_POSN                                    0x5
#define _IOCB_IOCB5_POSITION                                0x5
#define _IOCB_IOCB5_SIZE                                    0x1
#define _IOCB_IOCB5_LENGTH                                  0x1
#define _IOCB_IOCB5_MASK                                    0x20
#define _IOCB_IOCB6_POSN                                    0x6
#define _IOCB_IOCB6_POSITION                                0x6
#define _IOCB_IOCB6_SIZE                                    0x1
#define _IOCB_IOCB6_LENGTH                                  0x1
#define _IOCB_IOCB6_MASK                                    0x40
#define _IOCB_IOCB7_POSN                                    0x7
#define _IOCB_IOCB7_POSITION                                0x7
#define _IOCB_IOCB7_SIZE                                    0x1
#define _IOCB_IOCB7_LENGTH                                  0x1
#define _IOCB_IOCB7_MASK                                    0x80
#define _IOCB_IOC4_POSN                                     0x4
#define _IOCB_IOC4_POSITION                                 0x4
#define _IOCB_IOC4_SIZE                                     0x1
#define _IOCB_IOC4_LENGTH                                   0x1
#define _IOCB_IOC4_MASK                                     0x10
#define _IOCB_IOC5_POSN                                     0x5
#define _IOCB_IOC5_POSITION                                 0x5
#define _IOCB_IOC5_SIZE                                     0x1
#define _IOCB_IOC5_LENGTH                                   0x1
#define _IOCB_IOC5_MASK                                     0x20
#define _IOCB_IOC6_POSN                                     0x6
#define _IOCB_IOC6_POSITION                                 0x6
#define _IOCB_IOC6_SIZE                                     0x1
#define _IOCB_IOC6_LENGTH                                   0x1
#define _IOCB_IOC6_MASK                                     0x40
#define _IOCB_IOC7_POSN                                     0x7
#define _IOCB_IOC7_POSITION                                 0x7
#define _IOCB_IOC7_SIZE                                     0x1
#define _IOCB_IOC7_LENGTH                                   0x1
#define _IOCB_IOC7_MASK                                     0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned IOCB                   :4;
    };
    struct {
        unsigned                        :4;
        unsigned IOCB4                  :1;
        unsigned IOCB5                  :1;
        unsigned IOCB6                  :1;
        unsigned IOCB7                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned IOC4                   :1;
        unsigned IOC5                   :1;
        unsigned IOC6                   :1;
        unsigned IOC7                   :1;
    };
} IOCbits_t;
extern volatile IOCbits_t IOCbits __at(0x096);
// bitfield macros
#define _IOC_IOCB_POSN                                      0x4
#define _IOC_IOCB_POSITION                                  0x4
#define _IOC_IOCB_SIZE                                      0x4
#define _IOC_IOCB_LENGTH                                    0x4
#define _IOC_IOCB_MASK                                      0xF0
#define _IOC_IOCB4_POSN                                     0x4
#define _IOC_IOCB4_POSITION                                 0x4
#define _IOC_IOCB4_SIZE                                     0x1
#define _IOC_IOCB4_LENGTH                                   0x1
#define _IOC_IOCB4_MASK                                     0x10
#define _IOC_IOCB5_POSN                                     0x5
#define _IOC_IOCB5_POSITION                                 0x5
#define _IOC_IOCB5_SIZE                                     0x1
#define _IOC_IOCB5_LENGTH                                   0x1
#define _IOC_IOCB5_MASK                                     0x20
#define _IOC_IOCB6_POSN                                     0x6
#define _IOC_IOCB6_POSITION                                 0x6
#define _IOC_IOCB6_SIZE                                     0x1
#define _IOC_IOCB6_LENGTH                                   0x1
#define _IOC_IOCB6_MASK                                     0x40
#define _IOC_IOCB7_POSN                                     0x7
#define _IOC_IOCB7_POSITION                                 0x7
#define _IOC_IOCB7_SIZE                                     0x1
#define _IOC_IOCB7_LENGTH                                   0x1
#define _IOC_IOCB7_MASK                                     0x80
#define _IOC_IOC4_POSN                                      0x4
#define _IOC_IOC4_POSITION                                  0x4
#define _IOC_IOC4_SIZE                                      0x1
#define _IOC_IOC4_LENGTH                                    0x1
#define _IOC_IOC4_MASK                                      0x10
#define _IOC_IOC5_POSN                                      0x5
#define _IOC_IOC5_POSITION                                  0x5
#define _IOC_IOC5_SIZE                                      0x1
#define _IOC_IOC5_LENGTH                                    0x1
#define _IOC_IOC5_MASK                                      0x20
#define _IOC_IOC6_POSN                                      0x6
#define _IOC_IOC6_POSITION                                  0x6
#define _IOC_IOC6_SIZE                                      0x1
#define _IOC_IOC6_LENGTH                                    0x1
#define _IOC_IOC6_MASK                                      0x40
#define _IOC_IOC7_POSN                                      0x7
#define _IOC_IOC7_POSITION                                  0x7
#define _IOC_IOC7_SIZE                                      0x1
#define _IOC_IOC7_LENGTH                                    0x1
#define _IOC_IOC7_MASK                                      0x80

// Register: CMCON1
#define CMCON1 CMCON1
extern volatile unsigned char           CMCON1              __at(0x097);
#ifndef _LIB_BUILD
asm("CMCON1 equ 097h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C2SYNC                 :1;
        unsigned T1GSS                  :1;
    };
} CMCON1bits_t;
