MikroElektronika/core_packages/PIC/XC8/def/PIC16F917/mcu.h
extern volatile EEDATHbits_t EEDATHbits __at(0x10E);
// bitfield macros
#define _EEDATH_EEDATH0_POSN                                0x0
#define _EEDATH_EEDATH0_POSITION                            0x0
#define _EEDATH_EEDATH0_SIZE                                0x1
#define _EEDATH_EEDATH0_LENGTH                              0x1
#define _EEDATH_EEDATH0_MASK                                0x1
#define _EEDATH_EEDATH1_POSN                                0x1
#define _EEDATH_EEDATH1_POSITION                            0x1
#define _EEDATH_EEDATH1_SIZE                                0x1
#define _EEDATH_EEDATH1_LENGTH                              0x1
#define _EEDATH_EEDATH1_MASK                                0x2
#define _EEDATH_EEDATH2_POSN                                0x2
#define _EEDATH_EEDATH2_POSITION                            0x2
#define _EEDATH_EEDATH2_SIZE                                0x1
#define _EEDATH_EEDATH2_LENGTH                              0x1
#define _EEDATH_EEDATH2_MASK                                0x4
#define _EEDATH_EEDATH3_POSN                                0x3
#define _EEDATH_EEDATH3_POSITION                            0x3
#define _EEDATH_EEDATH3_SIZE                                0x1
#define _EEDATH_EEDATH3_LENGTH                              0x1
#define _EEDATH_EEDATH3_MASK                                0x8
#define _EEDATH_EEDATH4_POSN                                0x4
#define _EEDATH_EEDATH4_POSITION                            0x4
#define _EEDATH_EEDATH4_SIZE                                0x1
#define _EEDATH_EEDATH4_LENGTH                              0x1
#define _EEDATH_EEDATH4_MASK                                0x10
#define _EEDATH_EEDATH5_POSN                                0x5
#define _EEDATH_EEDATH5_POSITION                            0x5
#define _EEDATH_EEDATH5_SIZE                                0x1
#define _EEDATH_EEDATH5_LENGTH                              0x1
#define _EEDATH_EEDATH5_MASK                                0x20

// Register: EEADRH
#define EEADRH EEADRH
extern volatile unsigned char           EEADRH              __at(0x10F);
#ifndef _LIB_BUILD
asm("EEADRH equ 010Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEADRH0                :1;
        unsigned EEADRH1                :1;
        unsigned EEADRH2                :1;
        unsigned EEADRH3                :1;
        unsigned EEADRH4                :1;
    };
} EEADRHbits_t;
extern volatile EEADRHbits_t EEADRHbits __at(0x10F);
// bitfield macros
#define _EEADRH_EEADRH0_POSN                                0x0
#define _EEADRH_EEADRH0_POSITION                            0x0
#define _EEADRH_EEADRH0_SIZE                                0x1
#define _EEADRH_EEADRH0_LENGTH                              0x1
#define _EEADRH_EEADRH0_MASK                                0x1
#define _EEADRH_EEADRH1_POSN                                0x1
#define _EEADRH_EEADRH1_POSITION                            0x1
#define _EEADRH_EEADRH1_SIZE                                0x1
#define _EEADRH_EEADRH1_LENGTH                              0x1
#define _EEADRH_EEADRH1_MASK                                0x2
#define _EEADRH_EEADRH2_POSN                                0x2
#define _EEADRH_EEADRH2_POSITION                            0x2
#define _EEADRH_EEADRH2_SIZE                                0x1
#define _EEADRH_EEADRH2_LENGTH                              0x1
#define _EEADRH_EEADRH2_MASK                                0x4
#define _EEADRH_EEADRH3_POSN                                0x3
#define _EEADRH_EEADRH3_POSITION                            0x3
#define _EEADRH_EEADRH3_SIZE                                0x1
#define _EEADRH_EEADRH3_LENGTH                              0x1
#define _EEADRH_EEADRH3_MASK                                0x8
#define _EEADRH_EEADRH4_POSN                                0x4
#define _EEADRH_EEADRH4_POSITION                            0x4
#define _EEADRH_EEADRH4_SIZE                                0x1
#define _EEADRH_EEADRH4_LENGTH                              0x1
#define _EEADRH_EEADRH4_MASK                                0x10

// Register: LCDDATA0
#define LCDDATA0 LCDDATA0
extern volatile unsigned char           LCDDATA0            __at(0x110);
#ifndef _LIB_BUILD
asm("LCDDATA0 equ 0110h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG0                   :1;
        unsigned SEG1                   :1;
        unsigned SEG2                   :1;
        unsigned SEG3                   :1;
        unsigned SEG4                   :1;
        unsigned SEG5                   :1;
        unsigned SEG6                   :1;
        unsigned SEG7                   :1;
    };
    struct {
        unsigned SEG0COM0               :1;
        unsigned SEG1COM0               :1;
        unsigned SEG2COM0               :1;
        unsigned SEG3COM0               :1;
        unsigned SEG4COM0               :1;
        unsigned SEG5COM0               :1;
        unsigned SEG6COM0               :1;
        unsigned SEG7COM0               :1;
    };
    struct {
        unsigned S0C0                   :1;
        unsigned S1C0                   :1;
        unsigned S2C0                   :1;
        unsigned S3C0                   :1;
        unsigned S4C0                   :1;
        unsigned S5C0                   :1;
        unsigned S6C0                   :1;
        unsigned S7C0                   :1;
    };
} LCDDATA0bits_t;
extern volatile LCDDATA0bits_t LCDDATA0bits __at(0x110);
// bitfield macros
#define _LCDDATA0_SEG0_POSN                                 0x0
#define _LCDDATA0_SEG0_POSITION                             0x0
#define _LCDDATA0_SEG0_SIZE                                 0x1
#define _LCDDATA0_SEG0_LENGTH                               0x1
#define _LCDDATA0_SEG0_MASK                                 0x1
#define _LCDDATA0_SEG1_POSN                                 0x1
#define _LCDDATA0_SEG1_POSITION                             0x1
#define _LCDDATA0_SEG1_SIZE                                 0x1
#define _LCDDATA0_SEG1_LENGTH                               0x1
#define _LCDDATA0_SEG1_MASK                                 0x2
#define _LCDDATA0_SEG2_POSN                                 0x2
#define _LCDDATA0_SEG2_POSITION                             0x2
#define _LCDDATA0_SEG2_SIZE                                 0x1
#define _LCDDATA0_SEG2_LENGTH                               0x1
#define _LCDDATA0_SEG2_MASK                                 0x4
#define _LCDDATA0_SEG3_POSN                                 0x3
#define _LCDDATA0_SEG3_POSITION                             0x3
#define _LCDDATA0_SEG3_SIZE                                 0x1
#define _LCDDATA0_SEG3_LENGTH                               0x1
#define _LCDDATA0_SEG3_MASK                                 0x8
#define _LCDDATA0_SEG4_POSN                                 0x4
#define _LCDDATA0_SEG4_POSITION                             0x4
#define _LCDDATA0_SEG4_SIZE                                 0x1
#define _LCDDATA0_SEG4_LENGTH                               0x1
#define _LCDDATA0_SEG4_MASK                                 0x10
#define _LCDDATA0_SEG5_POSN                                 0x5
#define _LCDDATA0_SEG5_POSITION                             0x5
#define _LCDDATA0_SEG5_SIZE                                 0x1
#define _LCDDATA0_SEG5_LENGTH                               0x1
#define _LCDDATA0_SEG5_MASK                                 0x20
#define _LCDDATA0_SEG6_POSN                                 0x6
#define _LCDDATA0_SEG6_POSITION                             0x6
#define _LCDDATA0_SEG6_SIZE                                 0x1
#define _LCDDATA0_SEG6_LENGTH                               0x1
#define _LCDDATA0_SEG6_MASK                                 0x40
#define _LCDDATA0_SEG7_POSN                                 0x7
#define _LCDDATA0_SEG7_POSITION                             0x7
#define _LCDDATA0_SEG7_SIZE                                 0x1
#define _LCDDATA0_SEG7_LENGTH                               0x1
#define _LCDDATA0_SEG7_MASK                                 0x80
#define _LCDDATA0_SEG0COM0_POSN                             0x0
#define _LCDDATA0_SEG0COM0_POSITION                         0x0
#define _LCDDATA0_SEG0COM0_SIZE                             0x1
#define _LCDDATA0_SEG0COM0_LENGTH                           0x1
#define _LCDDATA0_SEG0COM0_MASK                             0x1
#define _LCDDATA0_SEG1COM0_POSN                             0x1
#define _LCDDATA0_SEG1COM0_POSITION                         0x1
#define _LCDDATA0_SEG1COM0_SIZE                             0x1
#define _LCDDATA0_SEG1COM0_LENGTH                           0x1
#define _LCDDATA0_SEG1COM0_MASK                             0x2
#define _LCDDATA0_SEG2COM0_POSN                             0x2
#define _LCDDATA0_SEG2COM0_POSITION                         0x2
#define _LCDDATA0_SEG2COM0_SIZE                             0x1
#define _LCDDATA0_SEG2COM0_LENGTH                           0x1
#define _LCDDATA0_SEG2COM0_MASK                             0x4
#define _LCDDATA0_SEG3COM0_POSN                             0x3
#define _LCDDATA0_SEG3COM0_POSITION                         0x3
#define _LCDDATA0_SEG3COM0_SIZE                             0x1
#define _LCDDATA0_SEG3COM0_LENGTH                           0x1
#define _LCDDATA0_SEG3COM0_MASK                             0x8
#define _LCDDATA0_SEG4COM0_POSN                             0x4
#define _LCDDATA0_SEG4COM0_POSITION                         0x4
#define _LCDDATA0_SEG4COM0_SIZE                             0x1
#define _LCDDATA0_SEG4COM0_LENGTH                           0x1
#define _LCDDATA0_SEG4COM0_MASK                             0x10
#define _LCDDATA0_SEG5COM0_POSN                             0x5
#define _LCDDATA0_SEG5COM0_POSITION                         0x5
#define _LCDDATA0_SEG5COM0_SIZE                             0x1
#define _LCDDATA0_SEG5COM0_LENGTH                           0x1
#define _LCDDATA0_SEG5COM0_MASK                             0x20
#define _LCDDATA0_SEG6COM0_POSN                             0x6
#define _LCDDATA0_SEG6COM0_POSITION                         0x6
#define _LCDDATA0_SEG6COM0_SIZE                             0x1
#define _LCDDATA0_SEG6COM0_LENGTH                           0x1
#define _LCDDATA0_SEG6COM0_MASK                             0x40
#define _LCDDATA0_SEG7COM0_POSN                             0x7
#define _LCDDATA0_SEG7COM0_POSITION                         0x7
#define _LCDDATA0_SEG7COM0_SIZE                             0x1
#define _LCDDATA0_SEG7COM0_LENGTH                           0x1
#define _LCDDATA0_SEG7COM0_MASK                             0x80
#define _LCDDATA0_S0C0_POSN                                 0x0
#define _LCDDATA0_S0C0_POSITION                             0x0
#define _LCDDATA0_S0C0_SIZE                                 0x1
#define _LCDDATA0_S0C0_LENGTH                               0x1
#define _LCDDATA0_S0C0_MASK                                 0x1
#define _LCDDATA0_S1C0_POSN                                 0x1
#define _LCDDATA0_S1C0_POSITION                             0x1
#define _LCDDATA0_S1C0_SIZE                                 0x1
#define _LCDDATA0_S1C0_LENGTH                               0x1
#define _LCDDATA0_S1C0_MASK                                 0x2
#define _LCDDATA0_S2C0_POSN                                 0x2
#define _LCDDATA0_S2C0_POSITION                             0x2
#define _LCDDATA0_S2C0_SIZE                                 0x1
#define _LCDDATA0_S2C0_LENGTH                               0x1
#define _LCDDATA0_S2C0_MASK                                 0x4
#define _LCDDATA0_S3C0_POSN                                 0x3
#define _LCDDATA0_S3C0_POSITION                             0x3
#define _LCDDATA0_S3C0_SIZE                                 0x1
#define _LCDDATA0_S3C0_LENGTH                               0x1
#define _LCDDATA0_S3C0_MASK                                 0x8
#define _LCDDATA0_S4C0_POSN                                 0x4
#define _LCDDATA0_S4C0_POSITION                             0x4
#define _LCDDATA0_S4C0_SIZE                                 0x1
#define _LCDDATA0_S4C0_LENGTH                               0x1
#define _LCDDATA0_S4C0_MASK                                 0x10
#define _LCDDATA0_S5C0_POSN                                 0x5
#define _LCDDATA0_S5C0_POSITION                             0x5
#define _LCDDATA0_S5C0_SIZE                                 0x1
#define _LCDDATA0_S5C0_LENGTH                               0x1
#define _LCDDATA0_S5C0_MASK                                 0x20
#define _LCDDATA0_S6C0_POSN                                 0x6
#define _LCDDATA0_S6C0_POSITION                             0x6
#define _LCDDATA0_S6C0_SIZE                                 0x1
#define _LCDDATA0_S6C0_LENGTH                               0x1
#define _LCDDATA0_S6C0_MASK                                 0x40
#define _LCDDATA0_S7C0_POSN                                 0x7
#define _LCDDATA0_S7C0_POSITION                             0x7
#define _LCDDATA0_S7C0_SIZE                                 0x1
#define _LCDDATA0_S7C0_LENGTH                               0x1
#define _LCDDATA0_S7C0_MASK                                 0x80

// Register: LCDDATA1
#define LCDDATA1 LCDDATA1
extern volatile unsigned char           LCDDATA1            __at(0x111);
#ifndef _LIB_BUILD
asm("LCDDATA1 equ 0111h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG8                   :1;
        unsigned SEG9                   :1;
        unsigned SEG10                  :1;
        unsigned SEG11                  :1;
        unsigned SEG12                  :1;
        unsigned SEG13                  :1;
        unsigned SEG14                  :1;
        unsigned SEG15                  :1;
    };
    struct {
        unsigned SEG8COM0               :1;
        unsigned SEG9COM0               :1;
        unsigned SEG10COM0              :1;
        unsigned SEG11COM0              :1;
        unsigned SEG12COM0              :1;
        unsigned SEG13COM0              :1;
        unsigned SEG14COM0              :1;
        unsigned SEG15COM0              :1;
    };
    struct {
        unsigned S8C0                   :1;
        unsigned S9C0                   :1;
        unsigned S10C0                  :1;
        unsigned S11C0                  :1;
        unsigned S12C0                  :1;
        unsigned S13C0                  :1;
        unsigned S14C0                  :1;
        unsigned S15C0                  :1;
    };
} LCDDATA1bits_t;
extern volatile LCDDATA1bits_t LCDDATA1bits __at(0x111);
// bitfield macros
#define _LCDDATA1_SEG8_POSN                                 0x0
#define _LCDDATA1_SEG8_POSITION                             0x0
#define _LCDDATA1_SEG8_SIZE                                 0x1
#define _LCDDATA1_SEG8_LENGTH                               0x1
#define _LCDDATA1_SEG8_MASK                                 0x1
#define _LCDDATA1_SEG9_POSN                                 0x1
#define _LCDDATA1_SEG9_POSITION                             0x1
#define _LCDDATA1_SEG9_SIZE                                 0x1
#define _LCDDATA1_SEG9_LENGTH                               0x1
#define _LCDDATA1_SEG9_MASK                                 0x2
#define _LCDDATA1_SEG10_POSN                                0x2
#define _LCDDATA1_SEG10_POSITION                            0x2
#define _LCDDATA1_SEG10_SIZE                                0x1
#define _LCDDATA1_SEG10_LENGTH                              0x1
#define _LCDDATA1_SEG10_MASK                                0x4
#define _LCDDATA1_SEG11_POSN                                0x3
#define _LCDDATA1_SEG11_POSITION                            0x3
#define _LCDDATA1_SEG11_SIZE                                0x1
#define _LCDDATA1_SEG11_LENGTH                              0x1
#define _LCDDATA1_SEG11_MASK                                0x8
#define _LCDDATA1_SEG12_POSN                                0x4
#define _LCDDATA1_SEG12_POSITION                            0x4
#define _LCDDATA1_SEG12_SIZE                                0x1
#define _LCDDATA1_SEG12_LENGTH                              0x1
#define _LCDDATA1_SEG12_MASK                                0x10
#define _LCDDATA1_SEG13_POSN                                0x5
#define _LCDDATA1_SEG13_POSITION                            0x5
#define _LCDDATA1_SEG13_SIZE                                0x1
#define _LCDDATA1_SEG13_LENGTH                              0x1
#define _LCDDATA1_SEG13_MASK                                0x20
#define _LCDDATA1_SEG14_POSN                                0x6
#define _LCDDATA1_SEG14_POSITION                            0x6
#define _LCDDATA1_SEG14_SIZE                                0x1
#define _LCDDATA1_SEG14_LENGTH                              0x1
#define _LCDDATA1_SEG14_MASK                                0x40
#define _LCDDATA1_SEG15_POSN                                0x7
#define _LCDDATA1_SEG15_POSITION                            0x7
#define _LCDDATA1_SEG15_SIZE                                0x1
#define _LCDDATA1_SEG15_LENGTH                              0x1
#define _LCDDATA1_SEG15_MASK                                0x80
#define _LCDDATA1_SEG8COM0_POSN                             0x0
#define _LCDDATA1_SEG8COM0_POSITION                         0x0
#define _LCDDATA1_SEG8COM0_SIZE                             0x1
#define _LCDDATA1_SEG8COM0_LENGTH                           0x1
#define _LCDDATA1_SEG8COM0_MASK                             0x1
#define _LCDDATA1_SEG9COM0_POSN                             0x1
#define _LCDDATA1_SEG9COM0_POSITION                         0x1
#define _LCDDATA1_SEG9COM0_SIZE                             0x1
#define _LCDDATA1_SEG9COM0_LENGTH                           0x1
#define _LCDDATA1_SEG9COM0_MASK                             0x2
#define _LCDDATA1_SEG10COM0_POSN                            0x2
#define _LCDDATA1_SEG10COM0_POSITION                        0x2
#define _LCDDATA1_SEG10COM0_SIZE                            0x1
#define _LCDDATA1_SEG10COM0_LENGTH                          0x1
#define _LCDDATA1_SEG10COM0_MASK                            0x4
#define _LCDDATA1_SEG11COM0_POSN                            0x3
#define _LCDDATA1_SEG11COM0_POSITION                        0x3
#define _LCDDATA1_SEG11COM0_SIZE                            0x1
#define _LCDDATA1_SEG11COM0_LENGTH                          0x1
#define _LCDDATA1_SEG11COM0_MASK                            0x8
#define _LCDDATA1_SEG12COM0_POSN                            0x4
#define _LCDDATA1_SEG12COM0_POSITION                        0x4
#define _LCDDATA1_SEG12COM0_SIZE                            0x1
#define _LCDDATA1_SEG12COM0_LENGTH                          0x1
#define _LCDDATA1_SEG12COM0_MASK                            0x10
#define _LCDDATA1_SEG13COM0_POSN                            0x5
#define _LCDDATA1_SEG13COM0_POSITION                        0x5
#define _LCDDATA1_SEG13COM0_SIZE                            0x1
#define _LCDDATA1_SEG13COM0_LENGTH                          0x1
#define _LCDDATA1_SEG13COM0_MASK                            0x20
#define _LCDDATA1_SEG14COM0_POSN                            0x6
#define _LCDDATA1_SEG14COM0_POSITION                        0x6
#define _LCDDATA1_SEG14COM0_SIZE                            0x1
#define _LCDDATA1_SEG14COM0_LENGTH                          0x1
#define _LCDDATA1_SEG14COM0_MASK                            0x40
#define _LCDDATA1_SEG15COM0_POSN                            0x7
#define _LCDDATA1_SEG15COM0_POSITION                        0x7
#define _LCDDATA1_SEG15COM0_SIZE                            0x1
#define _LCDDATA1_SEG15COM0_LENGTH                          0x1
#define _LCDDATA1_SEG15COM0_MASK                            0x80
#define _LCDDATA1_S8C0_POSN                                 0x0
#define _LCDDATA1_S8C0_POSITION                             0x0
#define _LCDDATA1_S8C0_SIZE                                 0x1
#define _LCDDATA1_S8C0_LENGTH                               0x1
#define _LCDDATA1_S8C0_MASK                                 0x1
#define _LCDDATA1_S9C0_POSN                                 0x1
#define _LCDDATA1_S9C0_POSITION                             0x1
#define _LCDDATA1_S9C0_SIZE                                 0x1
#define _LCDDATA1_S9C0_LENGTH                               0x1
#define _LCDDATA1_S9C0_MASK                                 0x2
#define _LCDDATA1_S10C0_POSN                                0x2
#define _LCDDATA1_S10C0_POSITION                            0x2
#define _LCDDATA1_S10C0_SIZE                                0x1
#define _LCDDATA1_S10C0_LENGTH                              0x1
#define _LCDDATA1_S10C0_MASK                                0x4
#define _LCDDATA1_S11C0_POSN                                0x3
#define _LCDDATA1_S11C0_POSITION                            0x3
#define _LCDDATA1_S11C0_SIZE                                0x1
#define _LCDDATA1_S11C0_LENGTH                              0x1
#define _LCDDATA1_S11C0_MASK                                0x8
#define _LCDDATA1_S12C0_POSN                                0x4
#define _LCDDATA1_S12C0_POSITION                            0x4
#define _LCDDATA1_S12C0_SIZE                                0x1
#define _LCDDATA1_S12C0_LENGTH                              0x1
#define _LCDDATA1_S12C0_MASK                                0x10
#define _LCDDATA1_S13C0_POSN                                0x5
#define _LCDDATA1_S13C0_POSITION                            0x5
#define _LCDDATA1_S13C0_SIZE                                0x1
#define _LCDDATA1_S13C0_LENGTH                              0x1
#define _LCDDATA1_S13C0_MASK                                0x20
#define _LCDDATA1_S14C0_POSN                                0x6
#define _LCDDATA1_S14C0_POSITION                            0x6
#define _LCDDATA1_S14C0_SIZE                                0x1
#define _LCDDATA1_S14C0_LENGTH                              0x1
#define _LCDDATA1_S14C0_MASK                                0x40
#define _LCDDATA1_S15C0_POSN                                0x7
#define _LCDDATA1_S15C0_POSITION                            0x7
#define _LCDDATA1_S15C0_SIZE                                0x1
#define _LCDDATA1_S15C0_LENGTH                              0x1
#define _LCDDATA1_S15C0_MASK                                0x80

// Register: LCDDATA2
#define LCDDATA2 LCDDATA2
extern volatile unsigned char           LCDDATA2            __at(0x112);
#ifndef _LIB_BUILD
asm("LCDDATA2 equ 0112h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG16                  :1;
        unsigned SEG17                  :1;
        unsigned SEG18                  :1;
        unsigned SEG19                  :1;
        unsigned SEG20                  :1;
        unsigned SEG21                  :1;
        unsigned SEG22                  :1;
        unsigned SEG23                  :1;
    };
    struct {
        unsigned SEG16COM0              :1;
        unsigned SEG17COM0              :1;
        unsigned SEG18COM0              :1;
        unsigned SEG19COM0              :1;
        unsigned SEG20COM0              :1;
        unsigned SEG21COM0              :1;
        unsigned SEG22COM0              :1;
        unsigned SEG23COM0              :1;
    };
    struct {
        unsigned S16C0                  :1;
        unsigned S17C0                  :1;
        unsigned S18C0                  :1;
        unsigned S19C0                  :1;
        unsigned S20C0                  :1;
        unsigned S21C0                  :1;
        unsigned S22C0                  :1;
        unsigned S23C0                  :1;
    };
} LCDDATA2bits_t;
