MikroElektronika/core_packages/PIC/XC8/def/PIC16F917/mcu.h
extern volatile LCDDATA2bits_t LCDDATA2bits __at(0x112);
// bitfield macros
#define _LCDDATA2_SEG16_POSN                                0x0
#define _LCDDATA2_SEG16_POSITION                            0x0
#define _LCDDATA2_SEG16_SIZE                                0x1
#define _LCDDATA2_SEG16_LENGTH                              0x1
#define _LCDDATA2_SEG16_MASK                                0x1
#define _LCDDATA2_SEG17_POSN                                0x1
#define _LCDDATA2_SEG17_POSITION                            0x1
#define _LCDDATA2_SEG17_SIZE                                0x1
#define _LCDDATA2_SEG17_LENGTH                              0x1
#define _LCDDATA2_SEG17_MASK                                0x2
#define _LCDDATA2_SEG18_POSN                                0x2
#define _LCDDATA2_SEG18_POSITION                            0x2
#define _LCDDATA2_SEG18_SIZE                                0x1
#define _LCDDATA2_SEG18_LENGTH                              0x1
#define _LCDDATA2_SEG18_MASK                                0x4
#define _LCDDATA2_SEG19_POSN                                0x3
#define _LCDDATA2_SEG19_POSITION                            0x3
#define _LCDDATA2_SEG19_SIZE                                0x1
#define _LCDDATA2_SEG19_LENGTH                              0x1
#define _LCDDATA2_SEG19_MASK                                0x8
#define _LCDDATA2_SEG20_POSN                                0x4
#define _LCDDATA2_SEG20_POSITION                            0x4
#define _LCDDATA2_SEG20_SIZE                                0x1
#define _LCDDATA2_SEG20_LENGTH                              0x1
#define _LCDDATA2_SEG20_MASK                                0x10
#define _LCDDATA2_SEG21_POSN                                0x5
#define _LCDDATA2_SEG21_POSITION                            0x5
#define _LCDDATA2_SEG21_SIZE                                0x1
#define _LCDDATA2_SEG21_LENGTH                              0x1
#define _LCDDATA2_SEG21_MASK                                0x20
#define _LCDDATA2_SEG22_POSN                                0x6
#define _LCDDATA2_SEG22_POSITION                            0x6
#define _LCDDATA2_SEG22_SIZE                                0x1
#define _LCDDATA2_SEG22_LENGTH                              0x1
#define _LCDDATA2_SEG22_MASK                                0x40
#define _LCDDATA2_SEG23_POSN                                0x7
#define _LCDDATA2_SEG23_POSITION                            0x7
#define _LCDDATA2_SEG23_SIZE                                0x1
#define _LCDDATA2_SEG23_LENGTH                              0x1
#define _LCDDATA2_SEG23_MASK                                0x80
#define _LCDDATA2_SEG16COM0_POSN                            0x0
#define _LCDDATA2_SEG16COM0_POSITION                        0x0
#define _LCDDATA2_SEG16COM0_SIZE                            0x1
#define _LCDDATA2_SEG16COM0_LENGTH                          0x1
#define _LCDDATA2_SEG16COM0_MASK                            0x1
#define _LCDDATA2_SEG17COM0_POSN                            0x1
#define _LCDDATA2_SEG17COM0_POSITION                        0x1
#define _LCDDATA2_SEG17COM0_SIZE                            0x1
#define _LCDDATA2_SEG17COM0_LENGTH                          0x1
#define _LCDDATA2_SEG17COM0_MASK                            0x2
#define _LCDDATA2_SEG18COM0_POSN                            0x2
#define _LCDDATA2_SEG18COM0_POSITION                        0x2
#define _LCDDATA2_SEG18COM0_SIZE                            0x1
#define _LCDDATA2_SEG18COM0_LENGTH                          0x1
#define _LCDDATA2_SEG18COM0_MASK                            0x4
#define _LCDDATA2_SEG19COM0_POSN                            0x3
#define _LCDDATA2_SEG19COM0_POSITION                        0x3
#define _LCDDATA2_SEG19COM0_SIZE                            0x1
#define _LCDDATA2_SEG19COM0_LENGTH                          0x1
#define _LCDDATA2_SEG19COM0_MASK                            0x8
#define _LCDDATA2_SEG20COM0_POSN                            0x4
#define _LCDDATA2_SEG20COM0_POSITION                        0x4
#define _LCDDATA2_SEG20COM0_SIZE                            0x1
#define _LCDDATA2_SEG20COM0_LENGTH                          0x1
#define _LCDDATA2_SEG20COM0_MASK                            0x10
#define _LCDDATA2_SEG21COM0_POSN                            0x5
#define _LCDDATA2_SEG21COM0_POSITION                        0x5
#define _LCDDATA2_SEG21COM0_SIZE                            0x1
#define _LCDDATA2_SEG21COM0_LENGTH                          0x1
#define _LCDDATA2_SEG21COM0_MASK                            0x20
#define _LCDDATA2_SEG22COM0_POSN                            0x6
#define _LCDDATA2_SEG22COM0_POSITION                        0x6
#define _LCDDATA2_SEG22COM0_SIZE                            0x1
#define _LCDDATA2_SEG22COM0_LENGTH                          0x1
#define _LCDDATA2_SEG22COM0_MASK                            0x40
#define _LCDDATA2_SEG23COM0_POSN                            0x7
#define _LCDDATA2_SEG23COM0_POSITION                        0x7
#define _LCDDATA2_SEG23COM0_SIZE                            0x1
#define _LCDDATA2_SEG23COM0_LENGTH                          0x1
#define _LCDDATA2_SEG23COM0_MASK                            0x80
#define _LCDDATA2_S16C0_POSN                                0x0
#define _LCDDATA2_S16C0_POSITION                            0x0
#define _LCDDATA2_S16C0_SIZE                                0x1
#define _LCDDATA2_S16C0_LENGTH                              0x1
#define _LCDDATA2_S16C0_MASK                                0x1
#define _LCDDATA2_S17C0_POSN                                0x1
#define _LCDDATA2_S17C0_POSITION                            0x1
#define _LCDDATA2_S17C0_SIZE                                0x1
#define _LCDDATA2_S17C0_LENGTH                              0x1
#define _LCDDATA2_S17C0_MASK                                0x2
#define _LCDDATA2_S18C0_POSN                                0x2
#define _LCDDATA2_S18C0_POSITION                            0x2
#define _LCDDATA2_S18C0_SIZE                                0x1
#define _LCDDATA2_S18C0_LENGTH                              0x1
#define _LCDDATA2_S18C0_MASK                                0x4
#define _LCDDATA2_S19C0_POSN                                0x3
#define _LCDDATA2_S19C0_POSITION                            0x3
#define _LCDDATA2_S19C0_SIZE                                0x1
#define _LCDDATA2_S19C0_LENGTH                              0x1
#define _LCDDATA2_S19C0_MASK                                0x8
#define _LCDDATA2_S20C0_POSN                                0x4
#define _LCDDATA2_S20C0_POSITION                            0x4
#define _LCDDATA2_S20C0_SIZE                                0x1
#define _LCDDATA2_S20C0_LENGTH                              0x1
#define _LCDDATA2_S20C0_MASK                                0x10
#define _LCDDATA2_S21C0_POSN                                0x5
#define _LCDDATA2_S21C0_POSITION                            0x5
#define _LCDDATA2_S21C0_SIZE                                0x1
#define _LCDDATA2_S21C0_LENGTH                              0x1
#define _LCDDATA2_S21C0_MASK                                0x20
#define _LCDDATA2_S22C0_POSN                                0x6
#define _LCDDATA2_S22C0_POSITION                            0x6
#define _LCDDATA2_S22C0_SIZE                                0x1
#define _LCDDATA2_S22C0_LENGTH                              0x1
#define _LCDDATA2_S22C0_MASK                                0x40
#define _LCDDATA2_S23C0_POSN                                0x7
#define _LCDDATA2_S23C0_POSITION                            0x7
#define _LCDDATA2_S23C0_SIZE                                0x1
#define _LCDDATA2_S23C0_LENGTH                              0x1
#define _LCDDATA2_S23C0_MASK                                0x80

// Register: LCDDATA3
#define LCDDATA3 LCDDATA3
extern volatile unsigned char           LCDDATA3            __at(0x113);
#ifndef _LIB_BUILD
asm("LCDDATA3 equ 0113h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG0                   :1;
        unsigned SEG1                   :1;
        unsigned SEG2                   :1;
        unsigned SEG3                   :1;
        unsigned SEG4                   :1;
        unsigned SEG5                   :1;
        unsigned SEG6                   :1;
        unsigned SEG7                   :1;
    };
    struct {
        unsigned SEG0COM1               :1;
        unsigned SEG1COM1               :1;
        unsigned SEG2COM1               :1;
        unsigned SEG3COM1               :1;
        unsigned SEG4COM1               :1;
        unsigned SEG5COM1               :1;
        unsigned SEG6COM1               :1;
        unsigned SEG7COM1               :1;
    };
    struct {
        unsigned S0C1                   :1;
        unsigned S1C1                   :1;
        unsigned S2C1                   :1;
        unsigned S3C1                   :1;
        unsigned S4C1                   :1;
        unsigned S5C1                   :1;
        unsigned S6C1                   :1;
        unsigned S7C1                   :1;
    };
} LCDDATA3bits_t;
extern volatile LCDDATA3bits_t LCDDATA3bits __at(0x113);
// bitfield macros
#define _LCDDATA3_SEG0_POSN                                 0x0
#define _LCDDATA3_SEG0_POSITION                             0x0
#define _LCDDATA3_SEG0_SIZE                                 0x1
#define _LCDDATA3_SEG0_LENGTH                               0x1
#define _LCDDATA3_SEG0_MASK                                 0x1
#define _LCDDATA3_SEG1_POSN                                 0x1
#define _LCDDATA3_SEG1_POSITION                             0x1
#define _LCDDATA3_SEG1_SIZE                                 0x1
#define _LCDDATA3_SEG1_LENGTH                               0x1
#define _LCDDATA3_SEG1_MASK                                 0x2
#define _LCDDATA3_SEG2_POSN                                 0x2
#define _LCDDATA3_SEG2_POSITION                             0x2
#define _LCDDATA3_SEG2_SIZE                                 0x1
#define _LCDDATA3_SEG2_LENGTH                               0x1
#define _LCDDATA3_SEG2_MASK                                 0x4
#define _LCDDATA3_SEG3_POSN                                 0x3
#define _LCDDATA3_SEG3_POSITION                             0x3
#define _LCDDATA3_SEG3_SIZE                                 0x1
#define _LCDDATA3_SEG3_LENGTH                               0x1
#define _LCDDATA3_SEG3_MASK                                 0x8
#define _LCDDATA3_SEG4_POSN                                 0x4
#define _LCDDATA3_SEG4_POSITION                             0x4
#define _LCDDATA3_SEG4_SIZE                                 0x1
#define _LCDDATA3_SEG4_LENGTH                               0x1
#define _LCDDATA3_SEG4_MASK                                 0x10
#define _LCDDATA3_SEG5_POSN                                 0x5
#define _LCDDATA3_SEG5_POSITION                             0x5
#define _LCDDATA3_SEG5_SIZE                                 0x1
#define _LCDDATA3_SEG5_LENGTH                               0x1
#define _LCDDATA3_SEG5_MASK                                 0x20
#define _LCDDATA3_SEG6_POSN                                 0x6
#define _LCDDATA3_SEG6_POSITION                             0x6
#define _LCDDATA3_SEG6_SIZE                                 0x1
#define _LCDDATA3_SEG6_LENGTH                               0x1
#define _LCDDATA3_SEG6_MASK                                 0x40
#define _LCDDATA3_SEG7_POSN                                 0x7
#define _LCDDATA3_SEG7_POSITION                             0x7
#define _LCDDATA3_SEG7_SIZE                                 0x1
#define _LCDDATA3_SEG7_LENGTH                               0x1
#define _LCDDATA3_SEG7_MASK                                 0x80
#define _LCDDATA3_SEG0COM1_POSN                             0x0
#define _LCDDATA3_SEG0COM1_POSITION                         0x0
#define _LCDDATA3_SEG0COM1_SIZE                             0x1
#define _LCDDATA3_SEG0COM1_LENGTH                           0x1
#define _LCDDATA3_SEG0COM1_MASK                             0x1
#define _LCDDATA3_SEG1COM1_POSN                             0x1
#define _LCDDATA3_SEG1COM1_POSITION                         0x1
#define _LCDDATA3_SEG1COM1_SIZE                             0x1
#define _LCDDATA3_SEG1COM1_LENGTH                           0x1
#define _LCDDATA3_SEG1COM1_MASK                             0x2
#define _LCDDATA3_SEG2COM1_POSN                             0x2
#define _LCDDATA3_SEG2COM1_POSITION                         0x2
#define _LCDDATA3_SEG2COM1_SIZE                             0x1
#define _LCDDATA3_SEG2COM1_LENGTH                           0x1
#define _LCDDATA3_SEG2COM1_MASK                             0x4
#define _LCDDATA3_SEG3COM1_POSN                             0x3
#define _LCDDATA3_SEG3COM1_POSITION                         0x3
#define _LCDDATA3_SEG3COM1_SIZE                             0x1
#define _LCDDATA3_SEG3COM1_LENGTH                           0x1
#define _LCDDATA3_SEG3COM1_MASK                             0x8
#define _LCDDATA3_SEG4COM1_POSN                             0x4
#define _LCDDATA3_SEG4COM1_POSITION                         0x4
#define _LCDDATA3_SEG4COM1_SIZE                             0x1
#define _LCDDATA3_SEG4COM1_LENGTH                           0x1
#define _LCDDATA3_SEG4COM1_MASK                             0x10
#define _LCDDATA3_SEG5COM1_POSN                             0x5
#define _LCDDATA3_SEG5COM1_POSITION                         0x5
#define _LCDDATA3_SEG5COM1_SIZE                             0x1
#define _LCDDATA3_SEG5COM1_LENGTH                           0x1
#define _LCDDATA3_SEG5COM1_MASK                             0x20
#define _LCDDATA3_SEG6COM1_POSN                             0x6
#define _LCDDATA3_SEG6COM1_POSITION                         0x6
#define _LCDDATA3_SEG6COM1_SIZE                             0x1
#define _LCDDATA3_SEG6COM1_LENGTH                           0x1
#define _LCDDATA3_SEG6COM1_MASK                             0x40
#define _LCDDATA3_SEG7COM1_POSN                             0x7
#define _LCDDATA3_SEG7COM1_POSITION                         0x7
#define _LCDDATA3_SEG7COM1_SIZE                             0x1
#define _LCDDATA3_SEG7COM1_LENGTH                           0x1
#define _LCDDATA3_SEG7COM1_MASK                             0x80
#define _LCDDATA3_S0C1_POSN                                 0x0
#define _LCDDATA3_S0C1_POSITION                             0x0
#define _LCDDATA3_S0C1_SIZE                                 0x1
#define _LCDDATA3_S0C1_LENGTH                               0x1
#define _LCDDATA3_S0C1_MASK                                 0x1
#define _LCDDATA3_S1C1_POSN                                 0x1
#define _LCDDATA3_S1C1_POSITION                             0x1
#define _LCDDATA3_S1C1_SIZE                                 0x1
#define _LCDDATA3_S1C1_LENGTH                               0x1
#define _LCDDATA3_S1C1_MASK                                 0x2
#define _LCDDATA3_S2C1_POSN                                 0x2
#define _LCDDATA3_S2C1_POSITION                             0x2
#define _LCDDATA3_S2C1_SIZE                                 0x1
#define _LCDDATA3_S2C1_LENGTH                               0x1
#define _LCDDATA3_S2C1_MASK                                 0x4
#define _LCDDATA3_S3C1_POSN                                 0x3
#define _LCDDATA3_S3C1_POSITION                             0x3
#define _LCDDATA3_S3C1_SIZE                                 0x1
#define _LCDDATA3_S3C1_LENGTH                               0x1
#define _LCDDATA3_S3C1_MASK                                 0x8
#define _LCDDATA3_S4C1_POSN                                 0x4
#define _LCDDATA3_S4C1_POSITION                             0x4
#define _LCDDATA3_S4C1_SIZE                                 0x1
#define _LCDDATA3_S4C1_LENGTH                               0x1
#define _LCDDATA3_S4C1_MASK                                 0x10
#define _LCDDATA3_S5C1_POSN                                 0x5
#define _LCDDATA3_S5C1_POSITION                             0x5
#define _LCDDATA3_S5C1_SIZE                                 0x1
#define _LCDDATA3_S5C1_LENGTH                               0x1
#define _LCDDATA3_S5C1_MASK                                 0x20
#define _LCDDATA3_S6C1_POSN                                 0x6
#define _LCDDATA3_S6C1_POSITION                             0x6
#define _LCDDATA3_S6C1_SIZE                                 0x1
#define _LCDDATA3_S6C1_LENGTH                               0x1
#define _LCDDATA3_S6C1_MASK                                 0x40
#define _LCDDATA3_S7C1_POSN                                 0x7
#define _LCDDATA3_S7C1_POSITION                             0x7
#define _LCDDATA3_S7C1_SIZE                                 0x1
#define _LCDDATA3_S7C1_LENGTH                               0x1
#define _LCDDATA3_S7C1_MASK                                 0x80

