MikroElektronika/core_packages/PIC/XC8/def/PIC16F917/mcu.h
// Register: LCDDATA4
#define LCDDATA4 LCDDATA4
extern volatile unsigned char           LCDDATA4            __at(0x114);
#ifndef _LIB_BUILD
asm("LCDDATA4 equ 0114h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG8                   :1;
        unsigned SEG9                   :1;
        unsigned SEG10                  :1;
        unsigned SEG11                  :1;
        unsigned SEG12                  :1;
        unsigned SEG13                  :1;
        unsigned SEG14                  :1;
        unsigned SEG15                  :1;
    };
    struct {
        unsigned SEG8COM1               :1;
        unsigned SEG9COM1               :1;
        unsigned SEG10COM1              :1;
        unsigned SEG11COM1              :1;
        unsigned SEG12COM1              :1;
        unsigned SEG13COM1              :1;
        unsigned SEG14COM1              :1;
        unsigned SEG15COM1              :1;
    };
    struct {
        unsigned S8C1                   :1;
        unsigned S9C1                   :1;
        unsigned S10C1                  :1;
        unsigned S11C1                  :1;
        unsigned S12C1                  :1;
        unsigned S13C1                  :1;
        unsigned S14C1                  :1;
        unsigned S15C1                  :1;
    };
} LCDDATA4bits_t;
extern volatile LCDDATA4bits_t LCDDATA4bits __at(0x114);
// bitfield macros
#define _LCDDATA4_SEG8_POSN                                 0x0
#define _LCDDATA4_SEG8_POSITION                             0x0
#define _LCDDATA4_SEG8_SIZE                                 0x1
#define _LCDDATA4_SEG8_LENGTH                               0x1
#define _LCDDATA4_SEG8_MASK                                 0x1
#define _LCDDATA4_SEG9_POSN                                 0x1
#define _LCDDATA4_SEG9_POSITION                             0x1
#define _LCDDATA4_SEG9_SIZE                                 0x1
#define _LCDDATA4_SEG9_LENGTH                               0x1
#define _LCDDATA4_SEG9_MASK                                 0x2
#define _LCDDATA4_SEG10_POSN                                0x2
#define _LCDDATA4_SEG10_POSITION                            0x2
#define _LCDDATA4_SEG10_SIZE                                0x1
#define _LCDDATA4_SEG10_LENGTH                              0x1
#define _LCDDATA4_SEG10_MASK                                0x4
#define _LCDDATA4_SEG11_POSN                                0x3
#define _LCDDATA4_SEG11_POSITION                            0x3
#define _LCDDATA4_SEG11_SIZE                                0x1
#define _LCDDATA4_SEG11_LENGTH                              0x1
#define _LCDDATA4_SEG11_MASK                                0x8
#define _LCDDATA4_SEG12_POSN                                0x4
#define _LCDDATA4_SEG12_POSITION                            0x4
#define _LCDDATA4_SEG12_SIZE                                0x1
#define _LCDDATA4_SEG12_LENGTH                              0x1
#define _LCDDATA4_SEG12_MASK                                0x10
#define _LCDDATA4_SEG13_POSN                                0x5
#define _LCDDATA4_SEG13_POSITION                            0x5
#define _LCDDATA4_SEG13_SIZE                                0x1
#define _LCDDATA4_SEG13_LENGTH                              0x1
#define _LCDDATA4_SEG13_MASK                                0x20
#define _LCDDATA4_SEG14_POSN                                0x6
#define _LCDDATA4_SEG14_POSITION                            0x6
#define _LCDDATA4_SEG14_SIZE                                0x1
#define _LCDDATA4_SEG14_LENGTH                              0x1
#define _LCDDATA4_SEG14_MASK                                0x40
#define _LCDDATA4_SEG15_POSN                                0x7
#define _LCDDATA4_SEG15_POSITION                            0x7
#define _LCDDATA4_SEG15_SIZE                                0x1
#define _LCDDATA4_SEG15_LENGTH                              0x1
#define _LCDDATA4_SEG15_MASK                                0x80
#define _LCDDATA4_SEG8COM1_POSN                             0x0
#define _LCDDATA4_SEG8COM1_POSITION                         0x0
#define _LCDDATA4_SEG8COM1_SIZE                             0x1
#define _LCDDATA4_SEG8COM1_LENGTH                           0x1
#define _LCDDATA4_SEG8COM1_MASK                             0x1
#define _LCDDATA4_SEG9COM1_POSN                             0x1
#define _LCDDATA4_SEG9COM1_POSITION                         0x1
#define _LCDDATA4_SEG9COM1_SIZE                             0x1
#define _LCDDATA4_SEG9COM1_LENGTH                           0x1
#define _LCDDATA4_SEG9COM1_MASK                             0x2
#define _LCDDATA4_SEG10COM1_POSN                            0x2
#define _LCDDATA4_SEG10COM1_POSITION                        0x2
#define _LCDDATA4_SEG10COM1_SIZE                            0x1
#define _LCDDATA4_SEG10COM1_LENGTH                          0x1
#define _LCDDATA4_SEG10COM1_MASK                            0x4
#define _LCDDATA4_SEG11COM1_POSN                            0x3
#define _LCDDATA4_SEG11COM1_POSITION                        0x3
#define _LCDDATA4_SEG11COM1_SIZE                            0x1
#define _LCDDATA4_SEG11COM1_LENGTH                          0x1
#define _LCDDATA4_SEG11COM1_MASK                            0x8
#define _LCDDATA4_SEG12COM1_POSN                            0x4
#define _LCDDATA4_SEG12COM1_POSITION                        0x4
#define _LCDDATA4_SEG12COM1_SIZE                            0x1
#define _LCDDATA4_SEG12COM1_LENGTH                          0x1
#define _LCDDATA4_SEG12COM1_MASK                            0x10
#define _LCDDATA4_SEG13COM1_POSN                            0x5
#define _LCDDATA4_SEG13COM1_POSITION                        0x5
#define _LCDDATA4_SEG13COM1_SIZE                            0x1
#define _LCDDATA4_SEG13COM1_LENGTH                          0x1
#define _LCDDATA4_SEG13COM1_MASK                            0x20
#define _LCDDATA4_SEG14COM1_POSN                            0x6
#define _LCDDATA4_SEG14COM1_POSITION                        0x6
#define _LCDDATA4_SEG14COM1_SIZE                            0x1
#define _LCDDATA4_SEG14COM1_LENGTH                          0x1
#define _LCDDATA4_SEG14COM1_MASK                            0x40
#define _LCDDATA4_SEG15COM1_POSN                            0x7
#define _LCDDATA4_SEG15COM1_POSITION                        0x7
#define _LCDDATA4_SEG15COM1_SIZE                            0x1
#define _LCDDATA4_SEG15COM1_LENGTH                          0x1
#define _LCDDATA4_SEG15COM1_MASK                            0x80
#define _LCDDATA4_S8C1_POSN                                 0x0
#define _LCDDATA4_S8C1_POSITION                             0x0
#define _LCDDATA4_S8C1_SIZE                                 0x1
#define _LCDDATA4_S8C1_LENGTH                               0x1
#define _LCDDATA4_S8C1_MASK                                 0x1
#define _LCDDATA4_S9C1_POSN                                 0x1
#define _LCDDATA4_S9C1_POSITION                             0x1
#define _LCDDATA4_S9C1_SIZE                                 0x1
#define _LCDDATA4_S9C1_LENGTH                               0x1
#define _LCDDATA4_S9C1_MASK                                 0x2
#define _LCDDATA4_S10C1_POSN                                0x2
#define _LCDDATA4_S10C1_POSITION                            0x2
#define _LCDDATA4_S10C1_SIZE                                0x1
#define _LCDDATA4_S10C1_LENGTH                              0x1
#define _LCDDATA4_S10C1_MASK                                0x4
#define _LCDDATA4_S11C1_POSN                                0x3
#define _LCDDATA4_S11C1_POSITION                            0x3
#define _LCDDATA4_S11C1_SIZE                                0x1
#define _LCDDATA4_S11C1_LENGTH                              0x1
#define _LCDDATA4_S11C1_MASK                                0x8
#define _LCDDATA4_S12C1_POSN                                0x4
#define _LCDDATA4_S12C1_POSITION                            0x4
#define _LCDDATA4_S12C1_SIZE                                0x1
#define _LCDDATA4_S12C1_LENGTH                              0x1
#define _LCDDATA4_S12C1_MASK                                0x10
#define _LCDDATA4_S13C1_POSN                                0x5
#define _LCDDATA4_S13C1_POSITION                            0x5
#define _LCDDATA4_S13C1_SIZE                                0x1
#define _LCDDATA4_S13C1_LENGTH                              0x1
#define _LCDDATA4_S13C1_MASK                                0x20
#define _LCDDATA4_S14C1_POSN                                0x6
#define _LCDDATA4_S14C1_POSITION                            0x6
#define _LCDDATA4_S14C1_SIZE                                0x1
#define _LCDDATA4_S14C1_LENGTH                              0x1
#define _LCDDATA4_S14C1_MASK                                0x40
#define _LCDDATA4_S15C1_POSN                                0x7
#define _LCDDATA4_S15C1_POSITION                            0x7
#define _LCDDATA4_S15C1_SIZE                                0x1
#define _LCDDATA4_S15C1_LENGTH                              0x1
#define _LCDDATA4_S15C1_MASK                                0x80

// Register: LCDDATA5
#define LCDDATA5 LCDDATA5
extern volatile unsigned char           LCDDATA5            __at(0x115);
#ifndef _LIB_BUILD
asm("LCDDATA5 equ 0115h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG16                  :1;
        unsigned SEG17                  :1;
        unsigned SEG18                  :1;
        unsigned SEG19                  :1;
        unsigned SEG20                  :1;
        unsigned SEG21                  :1;
        unsigned SEG22                  :1;
        unsigned SEG23                  :1;
    };
    struct {
        unsigned SEG16COM1              :1;
        unsigned SEG17COM1              :1;
        unsigned SEG18COM1              :1;
        unsigned SEG19COM1              :1;
        unsigned SEG20COM1              :1;
        unsigned SEG21COM1              :1;
        unsigned SEG22COM1              :1;
        unsigned SEG23COM1              :1;
    };
    struct {
        unsigned S16C1                  :1;
        unsigned S17C1                  :1;
        unsigned S18C1                  :1;
        unsigned S19C1                  :1;
        unsigned S20C1                  :1;
        unsigned S21C1                  :1;
        unsigned S22C1                  :1;
        unsigned S23C1                  :1;
    };
} LCDDATA5bits_t;
