MikroElektronika/core_packages/PIC/XC8/def/PIC16F917/mcu.h
extern volatile LCDDATA5bits_t LCDDATA5bits __at(0x115);
// bitfield macros
#define _LCDDATA5_SEG16_POSN                                0x0
#define _LCDDATA5_SEG16_POSITION                            0x0
#define _LCDDATA5_SEG16_SIZE                                0x1
#define _LCDDATA5_SEG16_LENGTH                              0x1
#define _LCDDATA5_SEG16_MASK                                0x1
#define _LCDDATA5_SEG17_POSN                                0x1
#define _LCDDATA5_SEG17_POSITION                            0x1
#define _LCDDATA5_SEG17_SIZE                                0x1
#define _LCDDATA5_SEG17_LENGTH                              0x1
#define _LCDDATA5_SEG17_MASK                                0x2
#define _LCDDATA5_SEG18_POSN                                0x2
#define _LCDDATA5_SEG18_POSITION                            0x2
#define _LCDDATA5_SEG18_SIZE                                0x1
#define _LCDDATA5_SEG18_LENGTH                              0x1
#define _LCDDATA5_SEG18_MASK                                0x4
#define _LCDDATA5_SEG19_POSN                                0x3
#define _LCDDATA5_SEG19_POSITION                            0x3
#define _LCDDATA5_SEG19_SIZE                                0x1
#define _LCDDATA5_SEG19_LENGTH                              0x1
#define _LCDDATA5_SEG19_MASK                                0x8
#define _LCDDATA5_SEG20_POSN                                0x4
#define _LCDDATA5_SEG20_POSITION                            0x4
#define _LCDDATA5_SEG20_SIZE                                0x1
#define _LCDDATA5_SEG20_LENGTH                              0x1
#define _LCDDATA5_SEG20_MASK                                0x10
#define _LCDDATA5_SEG21_POSN                                0x5
#define _LCDDATA5_SEG21_POSITION                            0x5
#define _LCDDATA5_SEG21_SIZE                                0x1
#define _LCDDATA5_SEG21_LENGTH                              0x1
#define _LCDDATA5_SEG21_MASK                                0x20
#define _LCDDATA5_SEG22_POSN                                0x6
#define _LCDDATA5_SEG22_POSITION                            0x6
#define _LCDDATA5_SEG22_SIZE                                0x1
#define _LCDDATA5_SEG22_LENGTH                              0x1
#define _LCDDATA5_SEG22_MASK                                0x40
#define _LCDDATA5_SEG23_POSN                                0x7
#define _LCDDATA5_SEG23_POSITION                            0x7
#define _LCDDATA5_SEG23_SIZE                                0x1
#define _LCDDATA5_SEG23_LENGTH                              0x1
#define _LCDDATA5_SEG23_MASK                                0x80
#define _LCDDATA5_SEG16COM1_POSN                            0x0
#define _LCDDATA5_SEG16COM1_POSITION                        0x0
#define _LCDDATA5_SEG16COM1_SIZE                            0x1
#define _LCDDATA5_SEG16COM1_LENGTH                          0x1
#define _LCDDATA5_SEG16COM1_MASK                            0x1
#define _LCDDATA5_SEG17COM1_POSN                            0x1
#define _LCDDATA5_SEG17COM1_POSITION                        0x1
#define _LCDDATA5_SEG17COM1_SIZE                            0x1
#define _LCDDATA5_SEG17COM1_LENGTH                          0x1
#define _LCDDATA5_SEG17COM1_MASK                            0x2
#define _LCDDATA5_SEG18COM1_POSN                            0x2
#define _LCDDATA5_SEG18COM1_POSITION                        0x2
#define _LCDDATA5_SEG18COM1_SIZE                            0x1
#define _LCDDATA5_SEG18COM1_LENGTH                          0x1
#define _LCDDATA5_SEG18COM1_MASK                            0x4
#define _LCDDATA5_SEG19COM1_POSN                            0x3
#define _LCDDATA5_SEG19COM1_POSITION                        0x3
#define _LCDDATA5_SEG19COM1_SIZE                            0x1
#define _LCDDATA5_SEG19COM1_LENGTH                          0x1
#define _LCDDATA5_SEG19COM1_MASK                            0x8
#define _LCDDATA5_SEG20COM1_POSN                            0x4
#define _LCDDATA5_SEG20COM1_POSITION                        0x4
#define _LCDDATA5_SEG20COM1_SIZE                            0x1
#define _LCDDATA5_SEG20COM1_LENGTH                          0x1
#define _LCDDATA5_SEG20COM1_MASK                            0x10
#define _LCDDATA5_SEG21COM1_POSN                            0x5
#define _LCDDATA5_SEG21COM1_POSITION                        0x5
#define _LCDDATA5_SEG21COM1_SIZE                            0x1
#define _LCDDATA5_SEG21COM1_LENGTH                          0x1
#define _LCDDATA5_SEG21COM1_MASK                            0x20
#define _LCDDATA5_SEG22COM1_POSN                            0x6
#define _LCDDATA5_SEG22COM1_POSITION                        0x6
#define _LCDDATA5_SEG22COM1_SIZE                            0x1
#define _LCDDATA5_SEG22COM1_LENGTH                          0x1
#define _LCDDATA5_SEG22COM1_MASK                            0x40
#define _LCDDATA5_SEG23COM1_POSN                            0x7
#define _LCDDATA5_SEG23COM1_POSITION                        0x7
#define _LCDDATA5_SEG23COM1_SIZE                            0x1
#define _LCDDATA5_SEG23COM1_LENGTH                          0x1
#define _LCDDATA5_SEG23COM1_MASK                            0x80
#define _LCDDATA5_S16C1_POSN                                0x0
#define _LCDDATA5_S16C1_POSITION                            0x0
#define _LCDDATA5_S16C1_SIZE                                0x1
#define _LCDDATA5_S16C1_LENGTH                              0x1
#define _LCDDATA5_S16C1_MASK                                0x1
#define _LCDDATA5_S17C1_POSN                                0x1
#define _LCDDATA5_S17C1_POSITION                            0x1
#define _LCDDATA5_S17C1_SIZE                                0x1
#define _LCDDATA5_S17C1_LENGTH                              0x1
#define _LCDDATA5_S17C1_MASK                                0x2
#define _LCDDATA5_S18C1_POSN                                0x2
#define _LCDDATA5_S18C1_POSITION                            0x2
#define _LCDDATA5_S18C1_SIZE                                0x1
#define _LCDDATA5_S18C1_LENGTH                              0x1
#define _LCDDATA5_S18C1_MASK                                0x4
#define _LCDDATA5_S19C1_POSN                                0x3
#define _LCDDATA5_S19C1_POSITION                            0x3
#define _LCDDATA5_S19C1_SIZE                                0x1
#define _LCDDATA5_S19C1_LENGTH                              0x1
#define _LCDDATA5_S19C1_MASK                                0x8
#define _LCDDATA5_S20C1_POSN                                0x4
#define _LCDDATA5_S20C1_POSITION                            0x4
#define _LCDDATA5_S20C1_SIZE                                0x1
#define _LCDDATA5_S20C1_LENGTH                              0x1
#define _LCDDATA5_S20C1_MASK                                0x10
#define _LCDDATA5_S21C1_POSN                                0x5
#define _LCDDATA5_S21C1_POSITION                            0x5
#define _LCDDATA5_S21C1_SIZE                                0x1
#define _LCDDATA5_S21C1_LENGTH                              0x1
#define _LCDDATA5_S21C1_MASK                                0x20
#define _LCDDATA5_S22C1_POSN                                0x6
#define _LCDDATA5_S22C1_POSITION                            0x6
#define _LCDDATA5_S22C1_SIZE                                0x1
#define _LCDDATA5_S22C1_LENGTH                              0x1
#define _LCDDATA5_S22C1_MASK                                0x40
#define _LCDDATA5_S23C1_POSN                                0x7
#define _LCDDATA5_S23C1_POSITION                            0x7
#define _LCDDATA5_S23C1_SIZE                                0x1
#define _LCDDATA5_S23C1_LENGTH                              0x1
#define _LCDDATA5_S23C1_MASK                                0x80

