MikroElektronika/core_packages/PIC/XC8/def/PIC16F917/mcu.h
extern volatile LCDDATA10bits_t LCDDATA10bits __at(0x11A);
// bitfield macros
#define _LCDDATA10_SEG8_POSN                                0x0
#define _LCDDATA10_SEG8_POSITION                            0x0
#define _LCDDATA10_SEG8_SIZE                                0x1
#define _LCDDATA10_SEG8_LENGTH                              0x1
#define _LCDDATA10_SEG8_MASK                                0x1
#define _LCDDATA10_SEG9_POSN                                0x1
#define _LCDDATA10_SEG9_POSITION                            0x1
#define _LCDDATA10_SEG9_SIZE                                0x1
#define _LCDDATA10_SEG9_LENGTH                              0x1
#define _LCDDATA10_SEG9_MASK                                0x2
#define _LCDDATA10_SEG10_POSN                               0x2
#define _LCDDATA10_SEG10_POSITION                           0x2
#define _LCDDATA10_SEG10_SIZE                               0x1
#define _LCDDATA10_SEG10_LENGTH                             0x1
#define _LCDDATA10_SEG10_MASK                               0x4
#define _LCDDATA10_SEG11_POSN                               0x3
#define _LCDDATA10_SEG11_POSITION                           0x3
#define _LCDDATA10_SEG11_SIZE                               0x1
#define _LCDDATA10_SEG11_LENGTH                             0x1
#define _LCDDATA10_SEG11_MASK                               0x8
#define _LCDDATA10_SEG12_POSN                               0x4
#define _LCDDATA10_SEG12_POSITION                           0x4
#define _LCDDATA10_SEG12_SIZE                               0x1
#define _LCDDATA10_SEG12_LENGTH                             0x1
#define _LCDDATA10_SEG12_MASK                               0x10
#define _LCDDATA10_SEG13_POSN                               0x5
#define _LCDDATA10_SEG13_POSITION                           0x5
#define _LCDDATA10_SEG13_SIZE                               0x1
#define _LCDDATA10_SEG13_LENGTH                             0x1
#define _LCDDATA10_SEG13_MASK                               0x20
#define _LCDDATA10_SEG14_POSN                               0x6
#define _LCDDATA10_SEG14_POSITION                           0x6
#define _LCDDATA10_SEG14_SIZE                               0x1
#define _LCDDATA10_SEG14_LENGTH                             0x1
#define _LCDDATA10_SEG14_MASK                               0x40
#define _LCDDATA10_SEG15_POSN                               0x7
#define _LCDDATA10_SEG15_POSITION                           0x7
#define _LCDDATA10_SEG15_SIZE                               0x1
#define _LCDDATA10_SEG15_LENGTH                             0x1
#define _LCDDATA10_SEG15_MASK                               0x80
#define _LCDDATA10_SEG8COM3_POSN                            0x0
#define _LCDDATA10_SEG8COM3_POSITION                        0x0
#define _LCDDATA10_SEG8COM3_SIZE                            0x1
#define _LCDDATA10_SEG8COM3_LENGTH                          0x1
#define _LCDDATA10_SEG8COM3_MASK                            0x1
#define _LCDDATA10_SEG9COM3_POSN                            0x1
#define _LCDDATA10_SEG9COM3_POSITION                        0x1
#define _LCDDATA10_SEG9COM3_SIZE                            0x1
#define _LCDDATA10_SEG9COM3_LENGTH                          0x1
#define _LCDDATA10_SEG9COM3_MASK                            0x2
#define _LCDDATA10_SEG10COM3_POSN                           0x2
#define _LCDDATA10_SEG10COM3_POSITION                       0x2
#define _LCDDATA10_SEG10COM3_SIZE                           0x1
#define _LCDDATA10_SEG10COM3_LENGTH                         0x1
#define _LCDDATA10_SEG10COM3_MASK                           0x4
#define _LCDDATA10_SEG11COM3_POSN                           0x3
#define _LCDDATA10_SEG11COM3_POSITION                       0x3
#define _LCDDATA10_SEG11COM3_SIZE                           0x1
#define _LCDDATA10_SEG11COM3_LENGTH                         0x1
#define _LCDDATA10_SEG11COM3_MASK                           0x8
#define _LCDDATA10_SEG12COM3_POSN                           0x4
#define _LCDDATA10_SEG12COM3_POSITION                       0x4
#define _LCDDATA10_SEG12COM3_SIZE                           0x1
#define _LCDDATA10_SEG12COM3_LENGTH                         0x1
#define _LCDDATA10_SEG12COM3_MASK                           0x10
#define _LCDDATA10_SEG13COM3_POSN                           0x5
#define _LCDDATA10_SEG13COM3_POSITION                       0x5
#define _LCDDATA10_SEG13COM3_SIZE                           0x1
#define _LCDDATA10_SEG13COM3_LENGTH                         0x1
#define _LCDDATA10_SEG13COM3_MASK                           0x20
#define _LCDDATA10_SEG14COM3_POSN                           0x6
#define _LCDDATA10_SEG14COM3_POSITION                       0x6
#define _LCDDATA10_SEG14COM3_SIZE                           0x1
#define _LCDDATA10_SEG14COM3_LENGTH                         0x1
#define _LCDDATA10_SEG14COM3_MASK                           0x40
#define _LCDDATA10_SEG15COM3_POSN                           0x7
#define _LCDDATA10_SEG15COM3_POSITION                       0x7
#define _LCDDATA10_SEG15COM3_SIZE                           0x1
#define _LCDDATA10_SEG15COM3_LENGTH                         0x1
#define _LCDDATA10_SEG15COM3_MASK                           0x80
#define _LCDDATA10_S8C3_POSN                                0x0
#define _LCDDATA10_S8C3_POSITION                            0x0
#define _LCDDATA10_S8C3_SIZE                                0x1
#define _LCDDATA10_S8C3_LENGTH                              0x1
#define _LCDDATA10_S8C3_MASK                                0x1
#define _LCDDATA10_S9C3_POSN                                0x1
#define _LCDDATA10_S9C3_POSITION                            0x1
#define _LCDDATA10_S9C3_SIZE                                0x1
#define _LCDDATA10_S9C3_LENGTH                              0x1
#define _LCDDATA10_S9C3_MASK                                0x2
#define _LCDDATA10_S10C3_POSN                               0x2
#define _LCDDATA10_S10C3_POSITION                           0x2
#define _LCDDATA10_S10C3_SIZE                               0x1
#define _LCDDATA10_S10C3_LENGTH                             0x1
#define _LCDDATA10_S10C3_MASK                               0x4
#define _LCDDATA10_S11C3_POSN                               0x3
#define _LCDDATA10_S11C3_POSITION                           0x3
#define _LCDDATA10_S11C3_SIZE                               0x1
#define _LCDDATA10_S11C3_LENGTH                             0x1
#define _LCDDATA10_S11C3_MASK                               0x8
#define _LCDDATA10_S12C3_POSN                               0x4
#define _LCDDATA10_S12C3_POSITION                           0x4
#define _LCDDATA10_S12C3_SIZE                               0x1
#define _LCDDATA10_S12C3_LENGTH                             0x1
#define _LCDDATA10_S12C3_MASK                               0x10
#define _LCDDATA10_S13C3_POSN                               0x5
#define _LCDDATA10_S13C3_POSITION                           0x5
#define _LCDDATA10_S13C3_SIZE                               0x1
#define _LCDDATA10_S13C3_LENGTH                             0x1
#define _LCDDATA10_S13C3_MASK                               0x20
#define _LCDDATA10_S14C3_POSN                               0x6
#define _LCDDATA10_S14C3_POSITION                           0x6
#define _LCDDATA10_S14C3_SIZE                               0x1
#define _LCDDATA10_S14C3_LENGTH                             0x1
#define _LCDDATA10_S14C3_MASK                               0x40
#define _LCDDATA10_S15C3_POSN                               0x7
#define _LCDDATA10_S15C3_POSITION                           0x7
#define _LCDDATA10_S15C3_SIZE                               0x1
#define _LCDDATA10_S15C3_LENGTH                             0x1
#define _LCDDATA10_S15C3_MASK                               0x80

// Register: LCDDATA11
#define LCDDATA11 LCDDATA11
extern volatile unsigned char           LCDDATA11           __at(0x11B);
#ifndef _LIB_BUILD
asm("LCDDATA11 equ 011Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG16                  :1;
        unsigned SEG17                  :1;
        unsigned SEG18                  :1;
        unsigned SEG19                  :1;
        unsigned SEG20                  :1;
        unsigned SEG21                  :1;
        unsigned SEG22                  :1;
        unsigned SEG23                  :1;
    };
    struct {
        unsigned SEG16COM3              :1;
        unsigned SEG17COM3              :1;
        unsigned SEG18COM3              :1;
        unsigned SEG19COM3              :1;
        unsigned SEG20COM3              :1;
        unsigned SEG21COM3              :1;
        unsigned SEG22COM3              :1;
        unsigned SEG23COM3              :1;
    };
    struct {
        unsigned S16C3                  :1;
        unsigned S17C3                  :1;
        unsigned S18C3                  :1;
        unsigned S19C3                  :1;
        unsigned S20C3                  :1;
        unsigned S21C3                  :1;
        unsigned S22C3                  :1;
        unsigned S23C3                  :1;
    };
} LCDDATA11bits_t;
extern volatile LCDDATA11bits_t LCDDATA11bits __at(0x11B);
// bitfield macros
#define _LCDDATA11_SEG16_POSN                               0x0
#define _LCDDATA11_SEG16_POSITION                           0x0
#define _LCDDATA11_SEG16_SIZE                               0x1
#define _LCDDATA11_SEG16_LENGTH                             0x1
#define _LCDDATA11_SEG16_MASK                               0x1
#define _LCDDATA11_SEG17_POSN                               0x1
#define _LCDDATA11_SEG17_POSITION                           0x1
#define _LCDDATA11_SEG17_SIZE                               0x1
#define _LCDDATA11_SEG17_LENGTH                             0x1
#define _LCDDATA11_SEG17_MASK                               0x2
#define _LCDDATA11_SEG18_POSN                               0x2
#define _LCDDATA11_SEG18_POSITION                           0x2
#define _LCDDATA11_SEG18_SIZE                               0x1
#define _LCDDATA11_SEG18_LENGTH                             0x1
#define _LCDDATA11_SEG18_MASK                               0x4
#define _LCDDATA11_SEG19_POSN                               0x3
#define _LCDDATA11_SEG19_POSITION                           0x3
#define _LCDDATA11_SEG19_SIZE                               0x1
#define _LCDDATA11_SEG19_LENGTH                             0x1
#define _LCDDATA11_SEG19_MASK                               0x8
#define _LCDDATA11_SEG20_POSN                               0x4
#define _LCDDATA11_SEG20_POSITION                           0x4
#define _LCDDATA11_SEG20_SIZE                               0x1
#define _LCDDATA11_SEG20_LENGTH                             0x1
#define _LCDDATA11_SEG20_MASK                               0x10
#define _LCDDATA11_SEG21_POSN                               0x5
#define _LCDDATA11_SEG21_POSITION                           0x5
#define _LCDDATA11_SEG21_SIZE                               0x1
#define _LCDDATA11_SEG21_LENGTH                             0x1
#define _LCDDATA11_SEG21_MASK                               0x20
#define _LCDDATA11_SEG22_POSN                               0x6
#define _LCDDATA11_SEG22_POSITION                           0x6
#define _LCDDATA11_SEG22_SIZE                               0x1
#define _LCDDATA11_SEG22_LENGTH                             0x1
#define _LCDDATA11_SEG22_MASK                               0x40
#define _LCDDATA11_SEG23_POSN                               0x7
#define _LCDDATA11_SEG23_POSITION                           0x7
#define _LCDDATA11_SEG23_SIZE                               0x1
#define _LCDDATA11_SEG23_LENGTH                             0x1
#define _LCDDATA11_SEG23_MASK                               0x80
#define _LCDDATA11_SEG16COM3_POSN                           0x0
#define _LCDDATA11_SEG16COM3_POSITION                       0x0
#define _LCDDATA11_SEG16COM3_SIZE                           0x1
#define _LCDDATA11_SEG16COM3_LENGTH                         0x1
#define _LCDDATA11_SEG16COM3_MASK                           0x1
#define _LCDDATA11_SEG17COM3_POSN                           0x1
#define _LCDDATA11_SEG17COM3_POSITION                       0x1
#define _LCDDATA11_SEG17COM3_SIZE                           0x1
#define _LCDDATA11_SEG17COM3_LENGTH                         0x1
#define _LCDDATA11_SEG17COM3_MASK                           0x2
#define _LCDDATA11_SEG18COM3_POSN                           0x2
#define _LCDDATA11_SEG18COM3_POSITION                       0x2
#define _LCDDATA11_SEG18COM3_SIZE                           0x1
#define _LCDDATA11_SEG18COM3_LENGTH                         0x1
#define _LCDDATA11_SEG18COM3_MASK                           0x4
#define _LCDDATA11_SEG19COM3_POSN                           0x3
#define _LCDDATA11_SEG19COM3_POSITION                       0x3
#define _LCDDATA11_SEG19COM3_SIZE                           0x1
#define _LCDDATA11_SEG19COM3_LENGTH                         0x1
#define _LCDDATA11_SEG19COM3_MASK                           0x8
#define _LCDDATA11_SEG20COM3_POSN                           0x4
#define _LCDDATA11_SEG20COM3_POSITION                       0x4
#define _LCDDATA11_SEG20COM3_SIZE                           0x1
#define _LCDDATA11_SEG20COM3_LENGTH                         0x1
#define _LCDDATA11_SEG20COM3_MASK                           0x10
#define _LCDDATA11_SEG21COM3_POSN                           0x5
#define _LCDDATA11_SEG21COM3_POSITION                       0x5
#define _LCDDATA11_SEG21COM3_SIZE                           0x1
#define _LCDDATA11_SEG21COM3_LENGTH                         0x1
#define _LCDDATA11_SEG21COM3_MASK                           0x20
#define _LCDDATA11_SEG22COM3_POSN                           0x6
#define _LCDDATA11_SEG22COM3_POSITION                       0x6
#define _LCDDATA11_SEG22COM3_SIZE                           0x1
#define _LCDDATA11_SEG22COM3_LENGTH                         0x1
#define _LCDDATA11_SEG22COM3_MASK                           0x40
#define _LCDDATA11_SEG23COM3_POSN                           0x7
#define _LCDDATA11_SEG23COM3_POSITION                       0x7
#define _LCDDATA11_SEG23COM3_SIZE                           0x1
#define _LCDDATA11_SEG23COM3_LENGTH                         0x1
#define _LCDDATA11_SEG23COM3_MASK                           0x80
#define _LCDDATA11_S16C3_POSN                               0x0
#define _LCDDATA11_S16C3_POSITION                           0x0
#define _LCDDATA11_S16C3_SIZE                               0x1
#define _LCDDATA11_S16C3_LENGTH                             0x1
#define _LCDDATA11_S16C3_MASK                               0x1
#define _LCDDATA11_S17C3_POSN                               0x1
#define _LCDDATA11_S17C3_POSITION                           0x1
#define _LCDDATA11_S17C3_SIZE                               0x1
#define _LCDDATA11_S17C3_LENGTH                             0x1
#define _LCDDATA11_S17C3_MASK                               0x2
#define _LCDDATA11_S18C3_POSN                               0x2
#define _LCDDATA11_S18C3_POSITION                           0x2
#define _LCDDATA11_S18C3_SIZE                               0x1
#define _LCDDATA11_S18C3_LENGTH                             0x1
#define _LCDDATA11_S18C3_MASK                               0x4
#define _LCDDATA11_S19C3_POSN                               0x3
#define _LCDDATA11_S19C3_POSITION                           0x3
#define _LCDDATA11_S19C3_SIZE                               0x1
#define _LCDDATA11_S19C3_LENGTH                             0x1
#define _LCDDATA11_S19C3_MASK                               0x8
#define _LCDDATA11_S20C3_POSN                               0x4
#define _LCDDATA11_S20C3_POSITION                           0x4
#define _LCDDATA11_S20C3_SIZE                               0x1
#define _LCDDATA11_S20C3_LENGTH                             0x1
#define _LCDDATA11_S20C3_MASK                               0x10
#define _LCDDATA11_S21C3_POSN                               0x5
#define _LCDDATA11_S21C3_POSITION                           0x5
#define _LCDDATA11_S21C3_SIZE                               0x1
#define _LCDDATA11_S21C3_LENGTH                             0x1
#define _LCDDATA11_S21C3_MASK                               0x20
#define _LCDDATA11_S22C3_POSN                               0x6
#define _LCDDATA11_S22C3_POSITION                           0x6
#define _LCDDATA11_S22C3_SIZE                               0x1
#define _LCDDATA11_S22C3_LENGTH                             0x1
#define _LCDDATA11_S22C3_MASK                               0x40
#define _LCDDATA11_S23C3_POSN                               0x7
#define _LCDDATA11_S23C3_POSITION                           0x7
#define _LCDDATA11_S23C3_SIZE                               0x1
#define _LCDDATA11_S23C3_LENGTH                             0x1
#define _LCDDATA11_S23C3_MASK                               0x80

// Register: LCDSE0
#define LCDSE0 LCDSE0
extern volatile unsigned char           LCDSE0              __at(0x11C);
#ifndef _LIB_BUILD
asm("LCDSE0 equ 011Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG0                   :1;
        unsigned SEG1                   :1;
        unsigned SEG2                   :1;
        unsigned SEG3                   :1;
        unsigned SEG4                   :1;
        unsigned SEG5                   :1;
        unsigned SEG6                   :1;
        unsigned SEG7                   :1;
    };
    struct {
        unsigned SE0                    :1;
        unsigned SE1                    :1;
        unsigned SE2                    :1;
        unsigned SE3                    :1;
        unsigned SE4                    :1;
        unsigned SE5                    :1;
        unsigned SE6                    :1;
        unsigned SE7                    :1;
    };
    struct {
        unsigned SEGEN0                 :1;
        unsigned SEGEN1                 :1;
        unsigned SEGEN2                 :1;
        unsigned SEGEN3                 :1;
        unsigned SEGEN4                 :1;
        unsigned SEGEN5                 :1;
        unsigned SEGEN6                 :1;
        unsigned SEGEN7                 :1;
    };
} LCDSE0bits_t;
