MikroElektronika/core_packages/PIC/XC8/def/PIC16F917/mcu.h
extern volatile LCDSE2bits_t LCDSE2bits __at(0x11E);
// bitfield macros
#define _LCDSE2_SEG16_POSN                                  0x0
#define _LCDSE2_SEG16_POSITION                              0x0
#define _LCDSE2_SEG16_SIZE                                  0x1
#define _LCDSE2_SEG16_LENGTH                                0x1
#define _LCDSE2_SEG16_MASK                                  0x1
#define _LCDSE2_SEG17_POSN                                  0x1
#define _LCDSE2_SEG17_POSITION                              0x1
#define _LCDSE2_SEG17_SIZE                                  0x1
#define _LCDSE2_SEG17_LENGTH                                0x1
#define _LCDSE2_SEG17_MASK                                  0x2
#define _LCDSE2_SEG18_POSN                                  0x2
#define _LCDSE2_SEG18_POSITION                              0x2
#define _LCDSE2_SEG18_SIZE                                  0x1
#define _LCDSE2_SEG18_LENGTH                                0x1
#define _LCDSE2_SEG18_MASK                                  0x4
#define _LCDSE2_SEG19_POSN                                  0x3
#define _LCDSE2_SEG19_POSITION                              0x3
#define _LCDSE2_SEG19_SIZE                                  0x1
#define _LCDSE2_SEG19_LENGTH                                0x1
#define _LCDSE2_SEG19_MASK                                  0x8
#define _LCDSE2_SEG20_POSN                                  0x4
#define _LCDSE2_SEG20_POSITION                              0x4
#define _LCDSE2_SEG20_SIZE                                  0x1
#define _LCDSE2_SEG20_LENGTH                                0x1
#define _LCDSE2_SEG20_MASK                                  0x10
#define _LCDSE2_SEG21_POSN                                  0x5
#define _LCDSE2_SEG21_POSITION                              0x5
#define _LCDSE2_SEG21_SIZE                                  0x1
#define _LCDSE2_SEG21_LENGTH                                0x1
#define _LCDSE2_SEG21_MASK                                  0x20
#define _LCDSE2_SEG22_POSN                                  0x6
#define _LCDSE2_SEG22_POSITION                              0x6
#define _LCDSE2_SEG22_SIZE                                  0x1
#define _LCDSE2_SEG22_LENGTH                                0x1
#define _LCDSE2_SEG22_MASK                                  0x40
#define _LCDSE2_SEG23_POSN                                  0x7
#define _LCDSE2_SEG23_POSITION                              0x7
#define _LCDSE2_SEG23_SIZE                                  0x1
#define _LCDSE2_SEG23_LENGTH                                0x1
#define _LCDSE2_SEG23_MASK                                  0x80
#define _LCDSE2_SE16_POSN                                   0x0
#define _LCDSE2_SE16_POSITION                               0x0
#define _LCDSE2_SE16_SIZE                                   0x1
#define _LCDSE2_SE16_LENGTH                                 0x1
#define _LCDSE2_SE16_MASK                                   0x1
#define _LCDSE2_SE17_POSN                                   0x1
#define _LCDSE2_SE17_POSITION                               0x1
#define _LCDSE2_SE17_SIZE                                   0x1
#define _LCDSE2_SE17_LENGTH                                 0x1
#define _LCDSE2_SE17_MASK                                   0x2
#define _LCDSE2_SE18_POSN                                   0x2
#define _LCDSE2_SE18_POSITION                               0x2
#define _LCDSE2_SE18_SIZE                                   0x1
#define _LCDSE2_SE18_LENGTH                                 0x1
#define _LCDSE2_SE18_MASK                                   0x4
#define _LCDSE2_SE19_POSN                                   0x3
#define _LCDSE2_SE19_POSITION                               0x3
#define _LCDSE2_SE19_SIZE                                   0x1
#define _LCDSE2_SE19_LENGTH                                 0x1
#define _LCDSE2_SE19_MASK                                   0x8
#define _LCDSE2_SE20_POSN                                   0x4
#define _LCDSE2_SE20_POSITION                               0x4
#define _LCDSE2_SE20_SIZE                                   0x1
#define _LCDSE2_SE20_LENGTH                                 0x1
#define _LCDSE2_SE20_MASK                                   0x10
#define _LCDSE2_SE21_POSN                                   0x5
#define _LCDSE2_SE21_POSITION                               0x5
#define _LCDSE2_SE21_SIZE                                   0x1
#define _LCDSE2_SE21_LENGTH                                 0x1
#define _LCDSE2_SE21_MASK                                   0x20
#define _LCDSE2_SE22_POSN                                   0x6
#define _LCDSE2_SE22_POSITION                               0x6
#define _LCDSE2_SE22_SIZE                                   0x1
#define _LCDSE2_SE22_LENGTH                                 0x1
#define _LCDSE2_SE22_MASK                                   0x40
#define _LCDSE2_SE23_POSN                                   0x7
#define _LCDSE2_SE23_POSITION                               0x7
#define _LCDSE2_SE23_SIZE                                   0x1
#define _LCDSE2_SE23_LENGTH                                 0x1
#define _LCDSE2_SE23_MASK                                   0x80
#define _LCDSE2_SEGEN16_POSN                                0x0
#define _LCDSE2_SEGEN16_POSITION                            0x0
#define _LCDSE2_SEGEN16_SIZE                                0x1
#define _LCDSE2_SEGEN16_LENGTH                              0x1
#define _LCDSE2_SEGEN16_MASK                                0x1
#define _LCDSE2_SEGEN17_POSN                                0x1
#define _LCDSE2_SEGEN17_POSITION                            0x1
#define _LCDSE2_SEGEN17_SIZE                                0x1
#define _LCDSE2_SEGEN17_LENGTH                              0x1
#define _LCDSE2_SEGEN17_MASK                                0x2
#define _LCDSE2_SEGEN18_POSN                                0x2
#define _LCDSE2_SEGEN18_POSITION                            0x2
#define _LCDSE2_SEGEN18_SIZE                                0x1
#define _LCDSE2_SEGEN18_LENGTH                              0x1
#define _LCDSE2_SEGEN18_MASK                                0x4
#define _LCDSE2_SEGEN19_POSN                                0x3
#define _LCDSE2_SEGEN19_POSITION                            0x3
#define _LCDSE2_SEGEN19_SIZE                                0x1
#define _LCDSE2_SEGEN19_LENGTH                              0x1
#define _LCDSE2_SEGEN19_MASK                                0x8
#define _LCDSE2_SEGEN20_POSN                                0x4
#define _LCDSE2_SEGEN20_POSITION                            0x4
#define _LCDSE2_SEGEN20_SIZE                                0x1
#define _LCDSE2_SEGEN20_LENGTH                              0x1
#define _LCDSE2_SEGEN20_MASK                                0x10
#define _LCDSE2_SEGEN21_POSN                                0x5
#define _LCDSE2_SEGEN21_POSITION                            0x5
#define _LCDSE2_SEGEN21_SIZE                                0x1
#define _LCDSE2_SEGEN21_LENGTH                              0x1
#define _LCDSE2_SEGEN21_MASK                                0x20
#define _LCDSE2_SEGEN22_POSN                                0x6
#define _LCDSE2_SEGEN22_POSITION                            0x6
#define _LCDSE2_SEGEN22_SIZE                                0x1
#define _LCDSE2_SEGEN22_LENGTH                              0x1
#define _LCDSE2_SEGEN22_MASK                                0x40
#define _LCDSE2_SEGEN23_POSN                                0x7
#define _LCDSE2_SEGEN23_POSITION                            0x7
#define _LCDSE2_SEGEN23_SIZE                                0x1
#define _LCDSE2_SEGEN23_LENGTH                              0x1
#define _LCDSE2_SEGEN23_MASK                                0x80

// Register: EECON1
#define EECON1 EECON1
extern volatile unsigned char           EECON1              __at(0x18C);
#ifndef _LIB_BUILD
asm("EECON1 equ 018Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned                        :3;
        unsigned EEPGD                  :1;
    };
    struct {
        unsigned EERD                   :1;
        unsigned EEWR                   :1;
    };
} EECON1bits_t;
extern volatile EECON1bits_t EECON1bits __at(0x18C);
// bitfield macros
#define _EECON1_RD_POSN                                     0x0
#define _EECON1_RD_POSITION                                 0x0
#define _EECON1_RD_SIZE                                     0x1
#define _EECON1_RD_LENGTH                                   0x1
#define _EECON1_RD_MASK                                     0x1
#define _EECON1_WR_POSN                                     0x1
#define _EECON1_WR_POSITION                                 0x1
#define _EECON1_WR_SIZE                                     0x1
#define _EECON1_WR_LENGTH                                   0x1
#define _EECON1_WR_MASK                                     0x2
#define _EECON1_WREN_POSN                                   0x2
#define _EECON1_WREN_POSITION                               0x2
#define _EECON1_WREN_SIZE                                   0x1
#define _EECON1_WREN_LENGTH                                 0x1
#define _EECON1_WREN_MASK                                   0x4
#define _EECON1_WRERR_POSN                                  0x3
#define _EECON1_WRERR_POSITION                              0x3
#define _EECON1_WRERR_SIZE                                  0x1
#define _EECON1_WRERR_LENGTH                                0x1
#define _EECON1_WRERR_MASK                                  0x8
#define _EECON1_EEPGD_POSN                                  0x7
#define _EECON1_EEPGD_POSITION                              0x7
#define _EECON1_EEPGD_SIZE                                  0x1
#define _EECON1_EEPGD_LENGTH                                0x1
#define _EECON1_EEPGD_MASK                                  0x80
#define _EECON1_EERD_POSN                                   0x0
#define _EECON1_EERD_POSITION                               0x0
#define _EECON1_EERD_SIZE                                   0x1
#define _EECON1_EERD_LENGTH                                 0x1
#define _EECON1_EERD_MASK                                   0x1
#define _EECON1_EEWR_POSN                                   0x1
#define _EECON1_EEWR_POSITION                               0x1
#define _EECON1_EEWR_SIZE                                   0x1
#define _EECON1_EEWR_LENGTH                                 0x1
#define _EECON1_EEWR_MASK                                   0x2

// Register: EECON2
#define EECON2 EECON2
extern volatile unsigned char           EECON2              __at(0x18D);
#ifndef _LIB_BUILD
asm("EECON2 equ 018Dh");
#endif

