MikroElektronika/core_packages/PIC/XC8/def/PIC16F917/mcu.h
// OSCCON<IRCF1>
extern volatile __bit                   IRCF1               __at(0x47D);	// @ (0x8F * 8 + 5)
#define                                 IRCF1_bit           _BIT_ACCESS(OSCCON,5)
// OSCCON<IRCF2>
extern volatile __bit                   IRCF2               __at(0x47E);	// @ (0x8F * 8 + 6)
#define                                 IRCF2_bit           _BIT_ACCESS(OSCCON,6)
// STATUS<IRP>
extern volatile __bit                   IRP                 __at(0x1F);	// @ (0x3 * 8 + 7)
#define                                 IRP_bit             _BIT_ACCESS(STATUS,7)
// LVDCON<IRVST>
extern volatile __bit                   IRVST               __at(0x84D);	// @ (0x109 * 8 + 5)
#define                                 IRVST_bit           _BIT_ACCESS(LVDCON,5)
// LCDPS<LCDA>
extern volatile __bit                   LCDA                __at(0x845);	// @ (0x108 * 8 + 5)
#define                                 LCDA_bit            _BIT_ACCESS(LCDPS,5)
// LCDCON<LCDEN>
extern volatile __bit                   LCDEN               __at(0x83F);	// @ (0x107 * 8 + 7)
#define                                 LCDEN_bit           _BIT_ACCESS(LCDCON,7)
// PIE2<LCDIE>
extern volatile __bit                   LCDIE               __at(0x46C);	// @ (0x8D * 8 + 4)
#define                                 LCDIE_bit           _BIT_ACCESS(PIE2,4)
// PIR2<LCDIF>
extern volatile __bit                   LCDIF               __at(0x6C);	// @ (0xD * 8 + 4)
#define                                 LCDIF_bit           _BIT_ACCESS(PIR2,4)
// LCDCON<LMUX0>
extern volatile __bit                   LMUX0               __at(0x838);	// @ (0x107 * 8 + 0)
#define                                 LMUX0_bit           _BIT_ACCESS(LCDCON,0)
// LCDCON<LMUX1>
extern volatile __bit                   LMUX1               __at(0x839);	// @ (0x107 * 8 + 1)
#define                                 LMUX1_bit           _BIT_ACCESS(LCDCON,1)
// LCDPS<LP0>
extern volatile __bit                   LP0                 __at(0x840);	// @ (0x108 * 8 + 0)
#define                                 LP0_bit             _BIT_ACCESS(LCDPS,0)
// LCDPS<LP1>
extern volatile __bit                   LP1                 __at(0x841);	// @ (0x108 * 8 + 1)
#define                                 LP1_bit             _BIT_ACCESS(LCDPS,1)
// LCDPS<LP2>
extern volatile __bit                   LP2                 __at(0x842);	// @ (0x108 * 8 + 2)
#define                                 LP2_bit             _BIT_ACCESS(LCDPS,2)
// LCDPS<LP3>
extern volatile __bit                   LP3                 __at(0x843);	// @ (0x108 * 8 + 3)
#define                                 LP3_bit             _BIT_ACCESS(LCDPS,3)
// OSCCON<LTS>
extern volatile __bit                   LTS                 __at(0x479);	// @ (0x8F * 8 + 1)
#define                                 LTS_bit             _BIT_ACCESS(OSCCON,1)
// LVDCON<LVDEN>
extern volatile __bit                   LVDEN               __at(0x84C);	// @ (0x109 * 8 + 4)
#define                                 LVDEN_bit           _BIT_ACCESS(LVDCON,4)
// PIE2<LVDIE>
extern volatile __bit                   LVDIE               __at(0x46A);	// @ (0x8D * 8 + 2)
#define                                 LVDIE_bit           _BIT_ACCESS(PIE2,2)
// PIR2<LVDIF>
extern volatile __bit                   LVDIF               __at(0x6A);	// @ (0xD * 8 + 2)
#define                                 LVDIF_bit           _BIT_ACCESS(PIR2,2)
// LVDCON<LVDL0>
extern volatile __bit                   LVDL0               __at(0x848);	// @ (0x109 * 8 + 0)
#define                                 LVDL0_bit           _BIT_ACCESS(LVDCON,0)
// LVDCON<LVDL1>
extern volatile __bit                   LVDL1               __at(0x849);	// @ (0x109 * 8 + 1)
#define                                 LVDL1_bit           _BIT_ACCESS(LVDCON,1)
// LVDCON<LVDL2>
extern volatile __bit                   LVDL2               __at(0x84A);	// @ (0x109 * 8 + 2)
#define                                 LVDL2_bit           _BIT_ACCESS(LVDCON,2)
// RCSTA<OERR>
extern volatile __bit                   OERR                __at(0xC1);	// @ (0x18 * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RCSTA,1)
// PIE2<OSFIE>
extern volatile __bit                   OSFIE               __at(0x46F);	// @ (0x8D * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE2,7)
// PIR2<OSFIF>
extern volatile __bit                   OSFIF               __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR2,7)
// OSCCON<OSTS>
extern volatile __bit                   OSTS                __at(0x47B);	// @ (0x8F * 8 + 3)
#define                                 OSTS_bit            _BIT_ACCESS(OSCCON,3)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// OPTION_REG<PS0>
extern volatile __bit                   PS0                 __at(0x408);	// @ (0x81 * 8 + 0)
#define                                 PS0_bit             _BIT_ACCESS(OPTION_REG,0)
// OPTION_REG<PS1>
extern volatile __bit                   PS1                 __at(0x409);	// @ (0x81 * 8 + 1)
#define                                 PS1_bit             _BIT_ACCESS(OPTION_REG,1)
// OPTION_REG<PS2>
extern volatile __bit                   PS2                 __at(0x40A);	// @ (0x81 * 8 + 2)
#define                                 PS2_bit             _BIT_ACCESS(OPTION_REG,2)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x40B);	// @ (0x81 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x28);	// @ (0x5 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x29);	// @ (0x5 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x2A);	// @ (0x5 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x2B);	// @ (0x5 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x2C);	// @ (0x5 * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x2D);	// @ (0x5 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x2E);	// @ (0x5 * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x2F);	// @ (0x5 * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x30);	// @ (0x6 * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x31);	// @ (0x6 * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x32);	// @ (0x6 * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x33);	// @ (0x6 * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x34);	// @ (0x6 * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x35);	// @ (0x6 * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x36);	// @ (0x6 * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x37);	// @ (0x6 * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// INTCON<RBIE>
extern volatile __bit                   RBIE                __at(0x5B);	// @ (0xB * 8 + 3)
#define                                 RBIE_bit            _BIT_ACCESS(INTCON,3)
// INTCON<RBIF>
extern volatile __bit                   RBIF                __at(0x58);	// @ (0xB * 8 + 0)
#define                                 RBIF_bit            _BIT_ACCESS(INTCON,0)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x38);	// @ (0x7 * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x39);	// @ (0x7 * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x3A);	// @ (0x7 * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x3B);	// @ (0x7 * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x3C);	// @ (0x7 * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x3D);	// @ (0x7 * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x3E);	// @ (0x7 * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x3F);	// @ (0x7 * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// RCSTA<RC8_9>
extern volatile __bit                   RC8_9               __at(0xC6);	// @ (0x18 * 8 + 6)
#define                                 RC8_9_bit           _BIT_ACCESS(RCSTA,6)
// RCSTA<RC9>
extern volatile __bit                   RC9                 __at(0xC6);	// @ (0x18 * 8 + 6)
#define                                 RC9_bit             _BIT_ACCESS(RCSTA,6)
// RCSTA<RCD8>
extern volatile __bit                   RCD8                __at(0xC0);	// @ (0x18 * 8 + 0)
#define                                 RCD8_bit            _BIT_ACCESS(RCSTA,0)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x465);	// @ (0x8C * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// EECON1<RD>
extern volatile __bit                   RD                  __at(0xC60);	// @ (0x18C * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(EECON1,0)
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x45);	// @ (0x8 * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x46);	// @ (0x8 * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<RD7>
extern volatile __bit                   RD7                 __at(0x47);	// @ (0x8 * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x48);	// @ (0x9 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x49);	// @ (0x9 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x4A);	// @ (0x9 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x4B);	// @ (0x9 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// SSPSTAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSPSTAT,2)
// STATUS<RP0>
extern volatile __bit                   RP0                 __at(0x1D);	// @ (0x3 * 8 + 5)
#define                                 RP0_bit             _BIT_ACCESS(STATUS,5)
// STATUS<RP1>
extern volatile __bit                   RP1                 __at(0x1E);	// @ (0x3 * 8 + 6)
#define                                 RP1_bit             _BIT_ACCESS(STATUS,6)
// RCSTA<RX9>
extern volatile __bit                   RX9                 __at(0xC6);	// @ (0x18 * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RCSTA,6)
// RCSTA<RX9D>
extern volatile __bit                   RX9D                __at(0xC0);	// @ (0x18 * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RCSTA,0)
// SSPSTAT<R_W>
extern volatile __bit                   R_W                 __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 R_W_bit             _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<R_nW>
extern volatile __bit                   R_nW                __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSPSTAT,2)
// LCDDATA0<S0C0>
extern volatile __bit                   S0C0                __at(0x880);	// @ (0x110 * 8 + 0)
#define                                 S0C0_bit            _BIT_ACCESS(LCDDATA0,0)
// LCDDATA3<S0C1>
extern volatile __bit                   S0C1                __at(0x898);	// @ (0x113 * 8 + 0)
#define                                 S0C1_bit            _BIT_ACCESS(LCDDATA3,0)
// LCDDATA6<S0C2>
extern volatile __bit                   S0C2                __at(0x8B0);	// @ (0x116 * 8 + 0)
#define                                 S0C2_bit            _BIT_ACCESS(LCDDATA6,0)
// LCDDATA9<S0C3>
extern volatile __bit                   S0C3                __at(0x8C8);	// @ (0x119 * 8 + 0)
#define                                 S0C3_bit            _BIT_ACCESS(LCDDATA9,0)
// LCDDATA1<S10C0>
extern volatile __bit                   S10C0               __at(0x88A);	// @ (0x111 * 8 + 2)
#define                                 S10C0_bit           _BIT_ACCESS(LCDDATA1,2)
// LCDDATA4<S10C1>
extern volatile __bit                   S10C1               __at(0x8A2);	// @ (0x114 * 8 + 2)
#define                                 S10C1_bit           _BIT_ACCESS(LCDDATA4,2)
// LCDDATA7<S10C2>
extern volatile __bit                   S10C2               __at(0x8BA);	// @ (0x117 * 8 + 2)
#define                                 S10C2_bit           _BIT_ACCESS(LCDDATA7,2)
// LCDDATA10<S10C3>
extern volatile __bit                   S10C3               __at(0x8D2);	// @ (0x11A * 8 + 2)
#define                                 S10C3_bit           _BIT_ACCESS(LCDDATA10,2)
// LCDDATA1<S11C0>
extern volatile __bit                   S11C0               __at(0x88B);	// @ (0x111 * 8 + 3)
#define                                 S11C0_bit           _BIT_ACCESS(LCDDATA1,3)
// LCDDATA4<S11C1>
extern volatile __bit                   S11C1               __at(0x8A3);	// @ (0x114 * 8 + 3)
#define                                 S11C1_bit           _BIT_ACCESS(LCDDATA4,3)
// LCDDATA7<S11C2>
extern volatile __bit                   S11C2               __at(0x8BB);	// @ (0x117 * 8 + 3)
#define                                 S11C2_bit           _BIT_ACCESS(LCDDATA7,3)
// LCDDATA10<S11C3>
extern volatile __bit                   S11C3               __at(0x8D3);	// @ (0x11A * 8 + 3)
#define                                 S11C3_bit           _BIT_ACCESS(LCDDATA10,3)
// LCDDATA1<S12C0>
extern volatile __bit                   S12C0               __at(0x88C);	// @ (0x111 * 8 + 4)
#define                                 S12C0_bit           _BIT_ACCESS(LCDDATA1,4)
// LCDDATA4<S12C1>
extern volatile __bit                   S12C1               __at(0x8A4);	// @ (0x114 * 8 + 4)
#define                                 S12C1_bit           _BIT_ACCESS(LCDDATA4,4)
// LCDDATA7<S12C2>
extern volatile __bit                   S12C2               __at(0x8BC);	// @ (0x117 * 8 + 4)
#define                                 S12C2_bit           _BIT_ACCESS(LCDDATA7,4)
// LCDDATA10<S12C3>
extern volatile __bit                   S12C3               __at(0x8D4);	// @ (0x11A * 8 + 4)
#define                                 S12C3_bit           _BIT_ACCESS(LCDDATA10,4)
// LCDDATA1<S13C0>
extern volatile __bit                   S13C0               __at(0x88D);	// @ (0x111 * 8 + 5)
#define                                 S13C0_bit           _BIT_ACCESS(LCDDATA1,5)
// LCDDATA4<S13C1>
extern volatile __bit                   S13C1               __at(0x8A5);	// @ (0x114 * 8 + 5)
#define                                 S13C1_bit           _BIT_ACCESS(LCDDATA4,5)
// LCDDATA7<S13C2>
extern volatile __bit                   S13C2               __at(0x8BD);	// @ (0x117 * 8 + 5)
#define                                 S13C2_bit           _BIT_ACCESS(LCDDATA7,5)
// LCDDATA10<S13C3>
extern volatile __bit                   S13C3               __at(0x8D5);	// @ (0x11A * 8 + 5)
#define                                 S13C3_bit           _BIT_ACCESS(LCDDATA10,5)
// LCDDATA1<S14C0>
extern volatile __bit                   S14C0               __at(0x88E);	// @ (0x111 * 8 + 6)
#define                                 S14C0_bit           _BIT_ACCESS(LCDDATA1,6)
// LCDDATA4<S14C1>
extern volatile __bit                   S14C1               __at(0x8A6);	// @ (0x114 * 8 + 6)
#define                                 S14C1_bit           _BIT_ACCESS(LCDDATA4,6)
// LCDDATA7<S14C2>
extern volatile __bit                   S14C2               __at(0x8BE);	// @ (0x117 * 8 + 6)
#define                                 S14C2_bit           _BIT_ACCESS(LCDDATA7,6)
// LCDDATA10<S14C3>
extern volatile __bit                   S14C3               __at(0x8D6);	// @ (0x11A * 8 + 6)
#define                                 S14C3_bit           _BIT_ACCESS(LCDDATA10,6)
// LCDDATA1<S15C0>
extern volatile __bit                   S15C0               __at(0x88F);	// @ (0x111 * 8 + 7)
#define                                 S15C0_bit           _BIT_ACCESS(LCDDATA1,7)
// LCDDATA4<S15C1>
extern volatile __bit                   S15C1               __at(0x8A7);	// @ (0x114 * 8 + 7)
#define                                 S15C1_bit           _BIT_ACCESS(LCDDATA4,7)
// LCDDATA7<S15C2>
extern volatile __bit                   S15C2               __at(0x8BF);	// @ (0x117 * 8 + 7)
#define                                 S15C2_bit           _BIT_ACCESS(LCDDATA7,7)
// LCDDATA10<S15C3>
extern volatile __bit                   S15C3               __at(0x8D7);	// @ (0x11A * 8 + 7)
#define                                 S15C3_bit           _BIT_ACCESS(LCDDATA10,7)
// LCDDATA2<S16C0>
extern volatile __bit                   S16C0               __at(0x890);	// @ (0x112 * 8 + 0)
#define                                 S16C0_bit           _BIT_ACCESS(LCDDATA2,0)
// LCDDATA5<S16C1>
extern volatile __bit                   S16C1               __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 S16C1_bit           _BIT_ACCESS(LCDDATA5,0)
// LCDDATA8<S16C2>
extern volatile __bit                   S16C2               __at(0x8C0);	// @ (0x118 * 8 + 0)
#define                                 S16C2_bit           _BIT_ACCESS(LCDDATA8,0)
// LCDDATA11<S16C3>
extern volatile __bit                   S16C3               __at(0x8D8);	// @ (0x11B * 8 + 0)
#define                                 S16C3_bit           _BIT_ACCESS(LCDDATA11,0)
// LCDDATA2<S17C0>
extern volatile __bit                   S17C0               __at(0x891);	// @ (0x112 * 8 + 1)
#define                                 S17C0_bit           _BIT_ACCESS(LCDDATA2,1)
// LCDDATA5<S17C1>
extern volatile __bit                   S17C1               __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 S17C1_bit           _BIT_ACCESS(LCDDATA5,1)
// LCDDATA8<S17C2>
extern volatile __bit                   S17C2               __at(0x8C1);	// @ (0x118 * 8 + 1)
#define                                 S17C2_bit           _BIT_ACCESS(LCDDATA8,1)
// LCDDATA11<S17C3>
extern volatile __bit                   S17C3               __at(0x8D9);	// @ (0x11B * 8 + 1)
#define                                 S17C3_bit           _BIT_ACCESS(LCDDATA11,1)
// LCDDATA2<S18C0>
extern volatile __bit                   S18C0               __at(0x892);	// @ (0x112 * 8 + 2)
#define                                 S18C0_bit           _BIT_ACCESS(LCDDATA2,2)
// LCDDATA5<S18C1>
extern volatile __bit                   S18C1               __at(0x8AA);	// @ (0x115 * 8 + 2)
#define                                 S18C1_bit           _BIT_ACCESS(LCDDATA5,2)
// LCDDATA8<S18C2>
extern volatile __bit                   S18C2               __at(0x8C2);	// @ (0x118 * 8 + 2)
#define                                 S18C2_bit           _BIT_ACCESS(LCDDATA8,2)
// LCDDATA11<S18C3>
extern volatile __bit                   S18C3               __at(0x8DA);	// @ (0x11B * 8 + 2)
#define                                 S18C3_bit           _BIT_ACCESS(LCDDATA11,2)
// LCDDATA2<S19C0>
extern volatile __bit                   S19C0               __at(0x893);	// @ (0x112 * 8 + 3)
#define                                 S19C0_bit           _BIT_ACCESS(LCDDATA2,3)
// LCDDATA5<S19C1>
extern volatile __bit                   S19C1               __at(0x8AB);	// @ (0x115 * 8 + 3)
#define                                 S19C1_bit           _BIT_ACCESS(LCDDATA5,3)
// LCDDATA8<S19C2>
extern volatile __bit                   S19C2               __at(0x8C3);	// @ (0x118 * 8 + 3)
#define                                 S19C2_bit           _BIT_ACCESS(LCDDATA8,3)
// LCDDATA11<S19C3>
extern volatile __bit                   S19C3               __at(0x8DB);	// @ (0x11B * 8 + 3)
#define                                 S19C3_bit           _BIT_ACCESS(LCDDATA11,3)
// LCDDATA0<S1C0>
